Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11ZR.atdf
        <module name="LP_CLK_CAL_REGS" id="LPCCR1234" version="1.0.0">
          <instance name="LP_CLK_CAL_REGS0">
            <register-group name="LP_CLK_CAL_REGS0" name-in-module="LP_CLK_CAL_REGS" address-space="base" offset="0x4000C000"/>
          </instance>
        </module>
        <module name="AON_SLEEP_TIMER" id="AONST1234" version="1.0.0">
          <instance name="AON_SLEEP_TIMER0">
            <register-group name="AON_SLEEP_TIMER0" name-in-module="AON_SLEEP_TIMER" address-space="base" offset="0x4000D000"/>
          </instance>
        </module>
        <module name="AON_PWR_SEQ" id="AONPS1234" version="1.0.0">
          <instance name="AON_PWR_SEQ0">
            <register-group name="AON_PWR_SEQ0" name-in-module="AON_PWR_SEQ" address-space="base" offset="0x4000E000"/>
          </instance>
        </module>
        <module name="AON_GP_REGS" id="AGR1234" version="1.0.0">
          <instance name="AON_GP_REGS0">
            <register-group name="AON_GP_REGS0" name-in-module="AON_GP_REGS" address-space="base" offset="0x4000F000"/>
          </instance>
        </module>
        <module name="GPIO" id="G1234" version="1.0.0">
          <instance name="GPIO0">
            <register-group name="GPIO0" name-in-module="GPIO" address-space="base" offset="0x40010000"/>
            <signals>
              <signal group="P" index="0" function="default" pad="LP_GPIO_0"/>
              <signal group="P" index="1" function="default" pad="LP_GPIO_1"/>
              <signal group="P" index="2" function="default" pad="LP_GPIO_2"/>
              <signal group="P" index="3" function="default" pad="LP_GPIO_3"/>
              <signal group="P" index="4" function="default" pad="LP_GPIO_4"/>
              <signal group="P" index="5" function="default" pad="LP_GPIO_5"/>
              <signal group="P" index="6" function="default" pad="LP_GPIO_6"/>
              <signal group="P" index="7" function="default" pad="LP_GPIO_7"/>
              <signal group="P" index="8" function="default" pad="LP_GPIO_8"/>
              <signal group="P" index="9" function="default" pad="LP_GPIO_9"/>
              <signal group="P" index="10" function="default" pad="LP_GPIO_10"/>
              <signal group="P" index="11" function="default" pad="LP_GPIO_11"/>
              <signal group="P" index="12" function="default" pad="LP_GPIO_12"/>
              <signal group="P" index="13" function="default" pad="LP_GPIO_13"/>
              <signal group="P" index="14" function="default" pad="LP_GPIO_14"/>
              <signal group="P" index="15" function="default" pad="LP_GPIO_15"/>
            </signals>
          </instance>
          <instance name="GPIO1">
            <register-group name="GPIO1" name-in-module="GPIO" address-space="base" offset="0x40011000"/>
            <signals>
              <signal group="P" index="16" function="default" pad="LP_GPIO_16"/>
              <signal group="P" index="17" function="default" pad="LP_GPIO_17"/>
              <signal group="P" index="18" function="default" pad="LP_GPIO_18"/>
              <signal group="P" index="19" function="default" pad="LP_GPIO_19"/>
              <signal group="P" index="29" function="default" pad="AO_GPIO_2"/>
              <signal group="P" index="30" function="default" pad="AO_GPIO_1"/>
              <signal group="P" index="31" function="default" pad="AO_GPIO_0"/>
            </signals>
          </instance>
          <instance name="GPIO2">
            <register-group name="GPIO2" name-in-module="GPIO" address-space="base" offset="0x40013000"/>
            <signals>
              <signal group="P" index="44" function="default" pad="GPIO_MS4"/>
              <signal group="P" index="45" function="default" pad="GPIO_MS3"/>
              <signal group="P" index="46" function="default" pad="GPIO_MS2"/>
              <signal group="P" index="47" function="default" pad="GPIO_MS1"/>
            </signals>
          </instance>
        </module>
        <module name="SPI_FLASH" id="SF1234" version="1.0.0">
          <instance name="SPI_FLASH0">
            <register-group name="SPI_FLASH0" name-in-module="SPI_FLASH" address-space="base" offset="0x40012000"/>
            <parameters>
              <param name="FLASH_SIZE" value="131072"/>
              <param name="PAGE_SIZE" value="64"/>
              <param name="PAGES" value="2048"/>
            <param name="ADDRESS_SPACE_REF" value="extflash"/></parameters>
            <signals>
              <signal group="SCK" function="SPI_FLASH0_SCK" pad="LP_SIP_0"/>
              <signal group="SCK" function="SPI_FLASH0_SCK" pad="LP_GPIO_2"/>
              <signal group="SCK" function="SPI_FLASH0_SCK" pad="LP_GPIO_6"/>
              <signal group="SCK" function="SPI_FLASH0_SCK" pad="LP_GPIO_10"/>
              <signal group="SCK" function="SPI_FLASH0_SCK" pad="LP_GPIO_16"/>
              <signal group="SSN" function="SPI_FLASH0_SSN" pad="LP_SIP_2"/>
              <signal group="SSN" function="SPI_FLASH0_SSN" pad="LP_GPIO_4"/>
              <signal group="SSN" function="SPI_FLASH0_SSN" pad="LP_GPIO_8"/>
              <signal group="SSN" function="SPI_FLASH0_SSN" pad="LP_GPIO_12"/>
              <signal group="SSN" function="SPI_FLASH0_SSN" pad="LP_GPIO_16"/>
              <signal group="SSN" function="SPI_FLASH0_SSN" pad="LP_GPIO_18"/>
              <signal group="TXD" function="SPI_FLASH0_TXD" pad="LP_SIP_1"/>
              <signal group="TXD" function="SPI_FLASH0_TXD" pad="LP_GPIO_3"/>
              <signal group="TXD" function="SPI_FLASH0_TXD" pad="LP_GPIO_7"/>
              <signal group="TXD" function="SPI_FLASH0_TXD" pad="LP_GPIO_11"/>
              <signal group="TXD" function="SPI_FLASH0_TXD" pad="LP_GPIO_17"/>
              <signal group="RXD" function="SPI_FLASH0_RXD" pad="LP_SIP_3"/>
              <signal group="RXD" function="SPI_FLASH0_RXD" pad="LP_GPIO_5"/>
              <signal group="RXD" function="SPI_FLASH0_RXD" pad="LP_GPIO_9"/>
              <signal group="RXD" function="SPI_FLASH0_RXD" pad="LP_GPIO_13"/>
              <signal group="RXD" function="SPI_FLASH0_RXD" pad="LP_GPIO_18"/>
              <signal group="RXD" function="SPI_FLASH0_RXD" pad="LP_GPIO_19"/>
              <signal group="WP" function="SPI_FLASH0_WP" pad="LP_SIP_4"/>
            </signals>
          </instance>
        </module>
