Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11ZR.atdf
        <register name="PID3" offset="0xFEC" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 3">
          <bitfield name="CUSTOMER_MOD_NUMBER" mask="0x0F" caption="Customer Modification Number"/>
          <bitfield name="ECO_REV_NUMBER" mask="0xF0" caption="ECO Revision Number"/>
        </register>
        <register name="CID0" offset="0xFF0" rw="R" size="1" initval="0x0D" caption="Component ID Register 0">
          <bitfield name="CID0" mask="0xFF"/>
        </register>
        <register name="CID1" offset="0xFF4" rw="R" size="1" initval="0xF0" caption="Component ID Register 1">
          <bitfield name="CID1" mask="0xFF"/>
        </register>
        <register name="CID2" offset="0xFF8" rw="R" size="1" initval="0x05" caption="Component ID Register 2">
          <bitfield name="CID2" mask="0xFF"/>
        </register>
        <register name="CID3" offset="0xFFC" rw="R" size="1" initval="0xB1" caption="Component ID Register 3">
          <bitfield name="CID3" mask="0xFF"/>
        </register>
      </register-group>
    </module>
    <module name="DUALTIMER" id="DT1234" version="1.0.0" caption="ARM General Purpose Dual Timer">
      <register-group name="DUALTIMER" caption="ARM General Purpose Dual Timer">
        <register name="TIMER1LOAD" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Timer 1 Load Register">
          <bitfield name="TIMER1LOAD" mask="0xFFFFFFFF"/>
        </register>
        <register name="TIMER1VALUE" offset="0x4" rw="R" size="4" initval="0xFFFFFFFF" caption="Timer 1 Current Value Register">
          <bitfield name="TIMER1VALUE" mask="0xFFFFFFFF"/>
        </register>
        <register name="TIMER1CONTROL" offset="0x8" rw="RW" size="1" initval="0x20" caption="Timer 1 Control Register">
          <bitfield name="ONE_SHOT_COUNT" mask="0x01" values="DUALTIMER_TIMER1CONTROL_ONE_SHOT_COUNT" caption="Mode Select"/>
          <bitfield name="TIMER_SIZE" mask="0x02" values="DUALTIMER_TIMER1CONTROL_TIMER_SIZE" caption="Timer Size"/>
          <bitfield name="TIMERPRE" mask="0x0C" values="DUALTIMER_TIMER1CONTROL_TIMERPRE" caption="Prescale Bits"/>
          <bitfield name="RESERVED4" mask="0x10" caption="Reserved bit do not use"/>
          <bitfield name="INTERRUPT_ENABLE" mask="0x20" caption="Active High Interrupt Enable Bit"/>
          <bitfield name="TIMER_MODE" mask="0x40" values="DUALTIMER_TIMER1CONTROL_TIMER_MODE" caption="Mode Bit"/>
          <bitfield name="TIMER_ENABLE" mask="0x80" caption="Active High Timer Enable"/>
        </register>
        <register name="TIMER1INTCLR" offset="0xC" rw="W" size="1" initval="0x0" caption="Timer 1 Interrupt Clear Register">
          <bitfield name="TIMER1INTCLR" mask="0x1"/>
        </register>
        <register name="TIMER1RIS" offset="0x10" rw="R" size="1" initval="0x0" caption="Timer 1 Raw Interrupt Status Register">
          <bitfield name="TIMER1RIS" mask="0x1"/>
        </register>
        <register name="TIMER1MIS" offset="0x14" rw="R" size="1" initval="0x0" caption="Timer 1 Masked Interrupt Status Register">
          <bitfield name="TIMER1MIS" mask="0x1"/>
        </register>
        <register name="TIMER1BGLOAD" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Timer 1 Background Load Register (Reload Value for Period Mode)">
          <bitfield name="TIMER1BGLOAD" mask="0xFFFFFFFF"/>
        </register>
        <register name="TIMER2LOAD" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Timer 2 Load Register">
          <bitfield name="TIMER2LOAD" mask="0xFFFFFFFF"/>
        </register>
        <register name="TIMER2VALUE" offset="0x24" rw="R" size="4" initval="0xFFFFFFFF" caption="Timer 2 Current Value Register">
          <bitfield name="TIMER2VALUE" mask="0xFFFFFFFF"/>
        </register>
        <register name="TIMER2CONTROL" offset="0x28" rw="RW" size="1" initval="0x20" caption="Timer 2 Control Register">
          <bitfield name="ONE_SHOT_COUNT" mask="0x01" values="DUALTIMER_TIMER2CONTROL_ONE_SHOT_COUNT" caption="Mode Select"/>
          <bitfield name="TIMER_SIZE" mask="0x02" values="DUALTIMER_TIMER2CONTROL_TIMER_SIZE" caption="Timer Size"/>
          <bitfield name="TIMERPRE" mask="0x0C" values="DUALTIMER_TIMER2CONTROL_TIMERPRE" caption="Prescale Bits"/>
          <bitfield name="RESERVED4" mask="0x10" caption="Reserved bit do not use"/>
          <bitfield name="INTERRUPT_ENABLE" mask="0x20" caption="Active High Interrupt Enable Bit"/>
          <bitfield name="TIMER_MODE" mask="0x40" values="DUALTIMER_TIMER2CONTROL_TIMER_MODE" caption="Mode Bit"/>
          <bitfield name="TIMER_ENABLE" mask="0x80" caption="Active High Timer Enable"/>
        </register>
        <register name="TIMER2INTCLR" offset="0x2C" rw="W" size="1" initval="0x0" caption="Timer 2 Interrupt Clear Register">
          <bitfield name="TIMER2INTCLR" mask="0x1"/>
        </register>
        <register name="TIMER2RIS" offset="0x30" rw="R" size="1" initval="0x0" caption="Timer 2 Raw Interrupt Status Register">
          <bitfield name="TIMER2RIS" mask="0x1"/>
        </register>
        <register name="TIMER2MIS" offset="0x34" rw="R" size="1" initval="0x0" caption="Timer 2 Masked Interrupt Status Register">
          <bitfield name="TIMER2MIS" mask="0x1"/>
        </register>
        <register name="TIMER2BGLOAD" offset="0x38" rw="RW" size="4" initval="0x00000000" caption="Timer 2 Background Load Register (Reload Value for Period Mode)">
          <bitfield name="TIMER2BGLOAD" mask="0xFFFFFFFF"/>
        </register>
        <register name="TIMERITCR" offset="0xF00" rw="RW" size="1" initval="0x0" caption="Integration Test Control Register">
          <bitfield name="TIMERITCR" mask="0x1"/>
        </register>
        <register name="TIMERITOP" offset="0xF04" rw="W" size="1" initval="0x0" caption="Integration Test Output Set Register">
          <bitfield name="INT_TEST_TIMINT1_VALUE" mask="0x1" caption="Value Output on TIMINT1 in Integration Test Mode"/>
          <bitfield name="INT_TEST_TIMING2_VALUE" mask="0x2" caption="Value Output on TIMINT2 in Integration Test Mode"/>
        </register>
        <register name="TIMERPERIPHID4" offset="0xFD0" rw="R" size="1" initval="0x04" caption="Peripheral ID Register 4">
          <bitfield name="JEP106_C_CODE" mask="0x0F" caption="JEP106 C Code"/>
          <bitfield name="BLOCK_COUNT" mask="0xF0" caption="Block Count"/>
        </register>
        <register name="TIMERPERIPHID5" offset="0xFD4" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 5">
          <bitfield name="TIMERPERIPHID5" mask="0xFF"/>
        </register>
        <register name="TIMERPERIPHID6" offset="0xFD8" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 6">
          <bitfield name="TIMERPERIPHID6" mask="0xFF"/>
        </register>
        <register name="TIMERPERIPHID7" offset="0xFDC" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 7">
          <bitfield name="TIMERPERIPHID7" mask="0xFF"/>
        </register>
        <register name="TIMERPERIPHID0" offset="0xFE0" rw="R" size="1" initval="0x23" caption="Peripheral ID Register 0">
          <bitfield name="PART_NUMBER" mask="0xFF" caption="Part Number Bits 7:0"/>
        </register>
        <register name="TIMERPERIPHID1" offset="0xFE4" rw="R" size="1" initval="0xB8" caption="Peripheral ID Register 1">
          <bitfield name="PART_NUMBER" mask="0x0F" caption="Part Number Bits 11:8"/>
          <bitfield name="JEP106_ID_3_0" mask="0xF0" caption="JEP106 ID Bits 3:0"/>
        </register>
        <register name="TIMERPERIPHID2" offset="0xFE8" rw="R" size="1" initval="0x1B" caption="Peripheral ID Register 2">
          <bitfield name="JEP106_ID_6_4" mask="0x07" caption="JEP106 ID Bits 6:4"/>
          <bitfield name="JEDEC_USED" mask="0x08" caption="JEDEC Used"/>
          <bitfield name="REVISION" mask="0xF0" caption="Revision"/>
        </register>
        <register name="TIMERPERIPHID3" offset="0xFEC" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 3">
          <bitfield name="CUSTOMER_MOD_NUMBER" mask="0x0F" caption="Customer Modification Number"/>
          <bitfield name="ECO_REV_NUMBER" mask="0xF0" caption="ECO Revision Number"/>
        </register>
        <register name="TIMERPCELLID0" offset="0xFF0" rw="R" size="1" initval="0x0D" caption="Component ID Register 0">
          <bitfield name="TIMERPCELLID0" mask="0xFF"/>
        </register>
