Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11ZR.atdf
        <register name="TIMERPCELLID1" offset="0xFF4" rw="R" size="1" initval="0xF0" caption="Component ID Register 1">
          <bitfield name="TIMERPCELLID1" mask="0xFF"/>
        </register>
        <register name="TIMERPCELLID2" offset="0xFF8" rw="R" size="1" initval="0x05" caption="Component ID Register 2">
          <bitfield name="TIMERPCELLID2" mask="0xFF"/>
        </register>
        <register name="TIMERPCELLID3" offset="0xFFC" rw="R" size="1" initval="0xB1" caption="Component ID Register 3">
          <bitfield name="TIMERPCELLID3" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="DUALTIMER_TIMER1CONTROL_ONE_SHOT_COUNT">
        <value name="0" caption="Wrapping Mode" value="0x0"/>
        <value name="1" caption="One-Shot Mode" value="0x1"/>
      </value-group>
      <value-group name="DUALTIMER_TIMER1CONTROL_TIMER_SIZE">
        <value name="0" caption="16-bit Counter" value="0x0"/>
        <value name="1" caption="32-bit Counter" value="0x1"/>
      </value-group>
      <value-group name="DUALTIMER_TIMER1CONTROL_TIMERPRE">
        <value name="0" caption="0 Stages, Clock Divided by 1" value="0x0"/>
        <value name="1" caption="4 Stages, Clock Divided by 16" value="0x1"/>
        <value name="2" caption="8 Stages, Clock Divided by 256" value="0x2"/>
        <value name="3" caption="Undefined, do not use" value="0x3"/>
      </value-group>
      <value-group name="DUALTIMER_TIMER1CONTROL_TIMER_MODE">
        <value name="0" caption="Free-Running Mode" value="0x0"/>
        <value name="1" caption="Periodic Mode" value="0x1"/>
      </value-group>
      <value-group name="DUALTIMER_TIMER2CONTROL_ONE_SHOT_COUNT">
        <value name="0" caption="Wrapping Mode" value="0x0"/>
        <value name="1" caption="One-Shot Mode" value="0x1"/>
      </value-group>
      <value-group name="DUALTIMER_TIMER2CONTROL_TIMER_SIZE">
        <value name="0" caption="16-bit Counter" value="0x0"/>
        <value name="1" caption="32-bit Counter" value="0x1"/>
      </value-group>
      <value-group name="DUALTIMER_TIMER2CONTROL_TIMERPRE">
        <value name="0" caption="0 Stages, Clock Divided by 1" value="0x0"/>
        <value name="1" caption="4 Stages, Clock Divided by 16" value="0x1"/>
        <value name="2" caption="8 Stages, Clock Divided by 256" value="0x2"/>
        <value name="3" caption="Undefined, do not use" value="0x3"/>
      </value-group>
      <value-group name="DUALTIMER_TIMER2CONTROL_TIMER_MODE">
        <value name="0" caption="Free-Running Mode" value="0x0"/>
        <value name="1" caption="Periodic Mode" value="0x1"/>
      </value-group>
    </module>
    <module name="PROV_DMA_CTRL" id="PDC1234" version="1.0.0" caption="4 Channel DMA Controller">
      <register-group name="PROV_DMA_CTRL" caption="4 Channel DMA Controller">
        <register name="CH0_CMD_REG0" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Channel 0 First Line Channel Command">
          <bitfield name="RD_START_ADDR" mask="0xFFFFFFFF" caption="Start Address of Read Buffer"/>
        </register>
        <register name="CH0_CMD_REG1" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Channel 0 Second Line Channel Command">
          <bitfield name="WR_START_ADDR" mask="0xFFFFFFFF" caption="Start Address of Write Buffer"/>
        </register>
        <register name="CH0_CMD_REG2" offset="0x8" rw="RW" size="2" initval="0x0000" caption="Channel 0 Third Line Channel Command">
          <bitfield name="BUFFER_SIZE" mask="0x1FFF" caption="Size (in Bytes) of Buffer to Transfer"/>
        </register>
        <register name="CH0_CMD_REG3" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Channel 0 Fourth Line Channel Command">
          <bitfield name="CMD_SET_INT" mask="0x00000001" caption="Active High Interrupt Enable once buffer has been transfered"/>
          <bitfield name="CMD_LAST" mask="0x00000002" caption="If set, channel stops when buffer done, otherwise load from CMD_NEXT_ADDR"/>
          <bitfield name="CMD_NEXT_ADDR" mask="0xFFFFFFFC" caption="Address of next command if CMD_LAST is not set"/>
        </register>
        <register name="CH0_STATIC_REG0" offset="0x10" rw="RW" size="4" initval="0x80010000" caption="Channel 0 Static Configuration Read">
          <bitfield name="RD_BURST_MAX_SIZE" mask="0x0000007F" caption="Maximum number of bytes of an AHB read burst"/>
          <bitfield name="RD_TOKENS" mask="0x003F0000" caption="Number of AHB read commands to issue before channel is released"/>
          <bitfield name="RD_INCR" mask="0x80000000" caption="If set the controller will increment the next burst address"/>
        </register>
        <register name="CH0_STATIC_REG1" offset="0x14" rw="RW" size="4" initval="0x80010000" caption="Channel 0 Static Configuration Write">
          <bitfield name="WR_BURST_MAX_SIZE" mask="0x0000007F" caption="Maximum number of bytes of an AHB write burst"/>
          <bitfield name="WR_TOKENS" mask="0x003F0000" caption="Number of AHB write commands to issue before channel is released"/>
          <bitfield name="WR_INCR" mask="0x80000000" caption="If set the controller will increment the next burst address"/>
        </register>
        <register name="CH0_STATIC_REG2" offset="0x18" rw="RW" size="4" initval="0x00010000" caption="Channel 0 Block Mode">
          <bitfield name="JOINT" mask="0x00010000" caption="If set channel will work in joint mode"/>
          <bitfield name="END_SWAP" mask="0x30000000" values="PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP" caption="Endianness Byte Swapping"/>
        </register>
        <register name="CH0_STATIC_REG4" offset="0x20" rw="RW" size="4" initval="0x0000000" caption="Channel 0 Static Configuration Peripheral">
          <bitfield name="RD_PERIPH_NUM" mask="0x000001F" caption="Number of peripheral to read from (0 if memory or no peripheral flow control)"/>
          <bitfield name="RD_PERIPH_DELAY" mask="0x0000700" caption="Number of cycles to wait for read request signal to update after issuing the read clear signal"/>
          <bitfield name="WR_PERIPH_NUM" mask="0x01F0000" caption="Number of peripheral to write from (0 if memory or no peripheral flow control)"/>
          <bitfield name="WR_PERIPH_DELAY" mask="0x7000000" caption="Number of cycles to wait for write request signal to update after issuing the write clear signal"/>
        </register>
        <register name="CH0_RESRICT_REG" offset="0x2C" rw="R" size="2" initval="0x000" caption="Channel 0 Restrictions Status Register">
          <bitfield name="RD_ALLOW_FULL_FIFO" mask="0x001" caption="Read start address does not restrict burst size"/>
          <bitfield name="WR_ALLOW_FULL_FIFO" mask="0x002" caption="Write start address does not restrict burst size"/>
          <bitfield name="ALLOW_FULL_FIFO" mask="0x004" caption="Burst sizes can equal data buffer size, otherwise max burst is half data buffer size"/>
          <bitfield name="ALLOW_FULL_BURST" mask="0x008" caption="Maximum burst of 16 strobes can be used (joint mode only)"/>
          <bitfield name="ALLOW_JOINT_BURST" mask="0x010" caption="Joint bursts are currently active"/>
          <bitfield name="SIMPLE_MEM" mask="0x100" caption="Configuration is aligned and peripherals are not used"/>
        </register>
        <register name="CH0_FIFO_FULLNESS_REG" offset="0x38" rw="R" size="4" initval="0x00000000" caption="Channel 0 FIFO Fullness Status Register">
          <bitfield name="RD_GAP" mask="0x00001FFF" caption="Remaining space (in bytes) in FIFO for read data"/>
          <bitfield name="WR_FULLNESS" mask="0x1FFF0000" caption="Occupied space (in bytes) in FIFO by write data"/>
        </register>
        <register name="CH0_CH_ENABLE_REG" offset="0x40" rw="RW" size="1" initval="0x1" caption="Channel 0 Channel Enable Register">
          <bitfield name="CH0_CH_ENABLE_REG" mask="0x1"/>
        </register>
        <register name="CH0_CH_START_REG" offset="0x44" rw="W" size="1" initval="0x0" caption="Channel 0 Channel Start Register">
          <bitfield name="CH0_CH_START_REG" mask="0x1"/>
        </register>
