Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11ZR.atdf
        <register name="RX_INTERRUPT_MASK" offset="0x30" rw="RW" size="1" initval="0x00" caption="Enable or Disable the generation of interrupts by the rx_status register. ">
          <bitfield name="RX_FIFO_NOT_EMPTY_MASK" mask="0x01" caption="Active High Enable of rx_fifo_not_empty interrupt "/>
          <bitfield name="RX_FIFO_0P25_FULL_MASK" mask="0x02" caption="Active High Enable of rx_fifo_0p25_full interrupt "/>
          <bitfield name="RX_FIFO_0P5_FULL_MASK" mask="0x04" caption="Active High Enable of rx_fifo_0p5_full interrupt "/>
          <bitfield name="RX_FIFO_0P75_FULL_MASK" mask="0x08" caption="Active High Enable of rx_fifo_0p75_full interrupt "/>
          <bitfield name="FAULT_DETECT_MASK" mask="0x10" caption="Active High Enable of fault detection interrupt "/>
          <bitfield name="FIFO_OVERRUN_MASK" mask="0x20" caption="Active High Enable of FIFO overrun interrupt "/>
        </register>
      </register-group>
      <value-group name="SPI_TRANSMIT_STATUS_TX_FIFO_NOT_FULL">
        <value name="0" caption="TX FIFO Full" value="0x0"/>
        <value name="1" caption="TX FIFO not Full" value="0x1"/>
      </value-group>
      <value-group name="SPI_CLOCK_SOURCE_SELECT_CLOCK">
        <value name="0" caption="26 MHz Clock" value="0x0"/>
        <value name="1" caption="13 MHz Clock" value="0x1"/>
        <value name="2" caption="6.5 MHz Clock" value="0x2"/>
        <value name="3" caption="3.25 MHz Clock" value="0x3"/>
      </value-group>
      <value-group name="SPI_SPI_MASTER_MODE_MASTER_ENABLE">
        <value name="0" caption="SPI Slave" value="0x0"/>
        <value name="1" caption="SPI Master" value="0x1"/>
      </value-group>
      <value-group name="SPI_SPI_FAULT_ENABLE_FAULT_ENABLE">
        <value name="0" caption="Faults ignored on SPI bus" value="0x0"/>
        <value name="1" caption="Faults detected on SPI bus" value="0x1"/>
      </value-group>
      <value-group name="SPI_SPI_CONFIGURATION_SCK_POLARITY">
        <value name="0" caption="SCK is Low" value="0x0"/>
        <value name="1" caption="SCK is High" value="0x1"/>
      </value-group>
      <value-group name="SPI_SPI_CONFIGURATION_SCK_PHASE">
        <value name="0" caption="Bits are sampled on the first edge and the following bit is output on the next edge" value="0x0"/>
        <value name="1" caption="Bits are output on the first edge and are sampled on the following edge" value="0x1"/>
      </value-group>
      <value-group name="SPI_SPI_CONFIGURATION_LSB_FIRST_ENABLE">
        <value name="0" caption="Data transmitted MSB first" value="0x0"/>
        <value name="1" caption="Data transmitted LSB first" value="0x1"/>
      </value-group>
      <value-group name="SPI_SPI_CONFIGURATION_BIDIRECTIONAL_ENABLE">
        <value name="0" caption="SPI is unidirectional, Tx and Rx each has dedicated one port" value="0x0"/>
        <value name="1" caption="SPI is bidirectional, Tx and Rx share one input/output port (MOSI if Master, MISO if Slave)" value="0x1"/>
      </value-group>
      <value-group name="SPI_SPI_CONFIGURATION_OUTPUT_ENABLE">
        <value name="0" caption="MISO is an input if in Slave mode. MOSI is an input if in Master mode" value="0x0"/>
        <value name="1" caption="MISO is an output if in Slave mode. MOSI is an output if in Master mode" value="0x1"/>
      </value-group>
      <value-group name="SPI_SPI_CONFIGURATION_SSN_SHIFT_ENABLE">
        <value name="0" caption="Shift counter is enabled only when ssn is asserted" value="0x0"/>
        <value name="1" caption="Shift counter is always enabled" value="0x1"/>
      </value-group>
      <value-group name="SPI_SPI_CONFIGURATION_SSN_SYNC_ENABLE">
        <value name="0" caption="SSN internal synchronisation is bypassed" value="0x0"/>
        <value name="1" caption="SSN is internally synchronised before being used" value="0x1"/>
      </value-group>
      <value-group name="SPI_SPI_CONFIGURATION_RX_DONE_SYNC_ENABLE">
        <value name="0" caption="rx_done internal synchronisation is bypassed" value="0x0"/>
        <value name="1" caption="rx_done is internally synchronised before being used" value="0x1"/>
      </value-group>
    </module>
    <module name="WDT" id="W1234" version="1.0.0" caption="Watchdog0 Timer">
      <register-group name="WDT" caption="Watchdog0 Timer">
        <register name="WDOGLOAD" offset="0x0" rw="RW" size="4" initval="0xFFFFFFFF" caption="Watchdog Load Register">
          <bitfield name="WDOGLOAD" mask="0xFFFFFFFF"/>
        </register>
        <register name="WDOGVALUE" offset="0x4" rw="R" size="4" initval="0xFFFFFFFF" caption="Watchdog Value Register">
          <bitfield name="WDOGVALUE" mask="0xFFFFFFFF"/>
        </register>
        <register name="WDOGCONTROL" offset="0x8" rw="RW" size="1" initval="0x0" caption="Watchdog Control Register">
          <bitfield name="INTEN" mask="0x1" caption="Active High Enable Interrupt Event"/>
          <bitfield name="RESEN" mask="0x2" caption="Active High Enable Watchdog Reset Output"/>
        </register>
        <register name="WDOGINTCLR" offset="0xC" rw="W" size="1" initval="0x0" caption="Watchdog Clear Interrupt Register">
          <bitfield name="WDOGINTCLR" mask="0x1"/>
        </register>
        <register name="WDOGRIS" offset="0x10" rw="R" size="1" initval="0x0" caption="Watchdog Raw Interrupt Status Register">
          <bitfield name="WDOGRIS" mask="0x1"/>
        </register>
        <register name="WDOGMIS" offset="0x14" rw="R" size="1" initval="0x0" caption="Watchdog Interrupt Status Register">
          <bitfield name="WDOGMIS" mask="0x1"/>
        </register>
        <register name="WDOGLOCK" offset="0xC00" rw="RW" size="4" initval="0x00000000" caption="Watchdog Lock Register (Write 0x1ACCE551 to enable write access to all other registers)">
          <bitfield name="ENABLE_STATUS" mask="0x00000001" caption="Read back of 1 indicates that write access is enabled"/>
          <bitfield name="ENABLE_REGISTER_WRITES" mask="0xFFFFFFFE" caption="Read back all 0s, write 0x1ACCE551 to enable write access to all other registers"/>
        </register>
