Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11ZR.atdf
        <register name="WDOGITCR" offset="0xF00" rw="RW" size="1" initval="0x0" caption="Watchdog Integration Test Control Register">
          <bitfield name="ENABLE" mask="0x1" caption="Set HIGH to place watchdog into integration test mode"/>
        </register>
        <register name="WDOGITOP" offset="0xF04" rw="RW" size="1" initval="0x0" caption="Watchdog Integration Test Output Set Register">
          <bitfield name="WDOGRES_VALUE" mask="0x1" caption="Value output on WDOGRES when in Integration Test Mode"/>
          <bitfield name="WDOGINT_VALUE" mask="0x2" caption="Value output on WDOGINT when in Integration Test Mode"/>
        </register>
        <register name="WDOGPERIPHID4" offset="0xFD0" rw="R" size="1" initval="0x04" caption="Peripheral ID Register 4">
          <bitfield name="JEP106_C_CODE" mask="0x0F" caption="JEP106 C Code"/>
          <bitfield name="BLOCK_COUNT" mask="0xF0" caption="Block Count"/>
        </register>
        <register name="WDOGPERIPHID5" offset="0xFD4" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 5">
          <bitfield name="WDOGPERIPHID5" mask="0xFF"/>
        </register>
        <register name="WDOGPERIPHID6" offset="0xFD8" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 6">
          <bitfield name="WDOGPERIPHID6" mask="0xFF"/>
        </register>
        <register name="WDOGPERIPHID7" offset="0xFDC" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 7">
          <bitfield name="WDOGPERIPHID7" mask="0xFF"/>
        </register>
        <register name="WDOGPERIPHID0" offset="0xFE0" rw="R" size="1" initval="0x24" caption="Peripheral ID Register 0">
          <bitfield name="PART_NUMBER" mask="0xFF" caption="Part Number Bits 7:0"/>
        </register>
        <register name="WDOGPERIPHID1" offset="0xFE4" rw="R" size="1" initval="0xB8" caption="Peripheral ID Register 1">
          <bitfield name="PART_NUMBER" mask="0x0F" caption="Part Number Bits 11:8"/>
          <bitfield name="JEP106_ID_3_0" mask="0xF0" caption="JEP106 ID Bits 3:0"/>
        </register>
        <register name="WDOGPERIPHID2" offset="0xFE8" rw="R" size="1" initval="0x1B" caption="Peripheral ID Register 2">
          <bitfield name="JEP106_ID_6_4" mask="0x07" caption="JEP106 ID Bits 6:4"/>
          <bitfield name="JEDEC_USED" mask="0x08" caption="JEDEC Used"/>
          <bitfield name="REVISION" mask="0xF0" caption="Revision"/>
        </register>
        <register name="WDOGPERIPHID3" offset="0xFEC" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 3">
          <bitfield name="CUSTOMER_MOD_NUMBER" mask="0x0F" caption="Customer Modification Number"/>
          <bitfield name="ECO_REV_NUMBER" mask="0xF0" caption="ECO Revision Number"/>
        </register>
        <register name="WDOGPCELLID0" offset="0xFF0" rw="R" size="1" initval="0x0D" caption="Component ID Register 0">
          <bitfield name="WDOGPCELLID0" mask="0xFF"/>
        </register>
        <register name="WDOGPCELLID1" offset="0xFF4" rw="R" size="1" initval="0xF0" caption="Component ID Register 1">
          <bitfield name="WDOGPCELLID1" mask="0xFF"/>
        </register>
        <register name="WDOGPCELLID2" offset="0xFF8" rw="R" size="1" initval="0x05" caption="Component ID Register 2">
          <bitfield name="WDOGPCELLID2" mask="0xFF"/>
        </register>
        <register name="WDOGPCELLID3" offset="0xFFC" rw="R" size="1" initval="0xB1" caption="Component ID Register 3">
          <bitfield name="WDOGPCELLID3" mask="0xFF"/>
        </register>
      </register-group>
    </module>
    <module name="EFUSE_MISC_REGS" id="EMR1234" version="1.0.0" caption="EFUSE Misc Registers">
      <register-group name="EFUSE_MISC_REGS" caption="EFUSE Misc Registers">
        <register name="EFUSE_GLOBAL_RESET" offset="0x0" rw="RW" size="1" initval="0x7F" caption="Active Low Global Reset">
          <bitfield name="GLOBAL_RSTN" mask="0x01" caption="Global Reset"/>
          <bitfield name="EFUSE_1_RSTN" mask="0x02" caption="EFUSE 1 Reset"/>
          <bitfield name="EFUSE_2_RSTN" mask="0x04" caption="EFUSE 2 Reset"/>
          <bitfield name="EFUSE_3_RSTN" mask="0x08" caption="EFUSE 3 Reset"/>
          <bitfield name="EFUSE_4_RSTN" mask="0x10" caption="EFUSE 4 Reset"/>
          <bitfield name="EFUSE_5_RSTN" mask="0x20" caption="EFUSE 5 Reset"/>
          <bitfield name="EFUSE_6_RSTN" mask="0x40" caption="EFUSE 6 Reset"/>
        </register>
        <register name="EFUSE_1_CONTROL" offset="0x4" rw="RW" size="4" initval="0x000003FC" caption="EFUSE 1 Control Register">
          <bitfield name="FORCE_LOAD" mask="0x00000001" caption="Efuse Control Force Load"/>
          <bitfield name="START_PROGRAM" mask="0x00000002" caption="When set to 1 will start programming EFUSE"/>
          <bitfield name="FIRST_READ_COUNT" mask="0x000007FC" caption="First Read Count"/>
          <bitfield name="FIRST_PROG_COUNT" mask="0x00007800" caption="First Program Count"/>
          <bitfield name="PROG_CLK_H_COUNT" mask="0x00FF8000" caption="First Clock High Count"/>
          <bitfield name="DEBUG_BUS_SEL" mask="0x07000000" caption="EFUSE Debug Bus Selection"/>
          <bitfield name="EFUSE_LOAD_DONE" mask="0x80000000" caption="Efuse Load Done Indication"/>
        </register>
        <register name="EFUSE_2_CONTROL" offset="0x8" rw="RW" size="4" initval="0x000003FC" caption="EFUSE 2 Control Register">
          <bitfield name="FORCE_LOAD" mask="0x00000001" caption="Efuse Control Force Load"/>
          <bitfield name="START_PROGRAM" mask="0x00000002" caption="When set to 1 will start programming EFUSE"/>
          <bitfield name="FIRST_READ_COUNT" mask="0x000007FC" caption="First Read Count"/>
          <bitfield name="FIRST_PROG_COUNT" mask="0x00007800" caption="First Program Count"/>
          <bitfield name="PROG_CLK_H_COUNT" mask="0x00FF8000" caption="First Clock High Count"/>
          <bitfield name="DEBUG_BUS_SEL" mask="0x07000000" caption="EFUSE Debug Bus Selection"/>
          <bitfield name="EFUSE_LOAD_DONE" mask="0x80000000" caption="Efuse Load Done Indication"/>
        </register>
