Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11ZR.atdf
        <register name="EFUSE_3_CONTROL" offset="0xC" rw="RW" size="4" initval="0x000003FC" caption="EFUSE 3 Control Register">
          <bitfield name="FORCE_LOAD" mask="0x00000001" caption="Efuse Control Force Load"/>
          <bitfield name="START_PROGRAM" mask="0x00000002" caption="When set to 1 will start programming EFUSE"/>
          <bitfield name="FIRST_READ_COUNT" mask="0x000007FC" caption="First Read Count"/>
          <bitfield name="FIRST_PROG_COUNT" mask="0x00007800" caption="First Program Count"/>
          <bitfield name="PROG_CLK_H_COUNT" mask="0x00FF8000" caption="First Clock High Count"/>
          <bitfield name="DEBUG_BUS_SEL" mask="0x07000000" caption="EFUSE Debug Bus Selection"/>
          <bitfield name="EFUSE_LOAD_DONE" mask="0x80000000" caption="Efuse Load Done Indication"/>
        </register>
        <register name="EFUSE_4_CONTROL" offset="0x10" rw="RW" size="4" initval="0x000003FC" caption="EFUSE 4 Control Register">
          <bitfield name="FORCE_LOAD" mask="0x00000001" caption="Efuse Control Force Load"/>
          <bitfield name="START_PROGRAM" mask="0x00000002" caption="When set to 1 will start programming EFUSE"/>
          <bitfield name="FIRST_READ_COUNT" mask="0x000007FC" caption="First Read Count"/>
          <bitfield name="FIRST_PROG_COUNT" mask="0x00007800" caption="First Program Count"/>
          <bitfield name="PROG_CLK_H_COUNT" mask="0x00FF8000" caption="First Clock High Count"/>
          <bitfield name="DEBUG_BUS_SEL" mask="0x07000000" caption="EFUSE Debug Bus Selection"/>
          <bitfield name="EFUSE_LOAD_DONE" mask="0x80000000" caption="Efuse Load Done Indication"/>
        </register>
        <register name="EFUSE_5_CONTROL" offset="0x14" rw="RW" size="4" initval="0x000003FC" caption="EFUSE 5 Control Register">
          <bitfield name="FORCE_LOAD" mask="0x00000001" caption="Efuse Control Force Load"/>
          <bitfield name="START_PROGRAM" mask="0x00000002" caption="When set to 1 will start programming EFUSE"/>
          <bitfield name="FIRST_READ_COUNT" mask="0x000007FC" caption="First Read Count"/>
          <bitfield name="FIRST_PROG_COUNT" mask="0x00007800" caption="First Program Count"/>
          <bitfield name="PROG_CLK_H_COUNT" mask="0x00FF8000" caption="First Clock High Count"/>
          <bitfield name="DEBUG_BUS_SEL" mask="0x07000000" caption="EFUSE Debug Bus Selection"/>
          <bitfield name="EFUSE_LOAD_DONE" mask="0x80000000" caption="Efuse Load Done Indication"/>
        </register>
        <register name="EFUSE_6_CONTROL" offset="0x18" rw="RW" size="4" initval="0x000003FC" caption="EFUSE 6 Control Register">
          <bitfield name="FORCE_LOAD" mask="0x00000001" caption="Efuse Control Force Load"/>
          <bitfield name="START_PROGRAM" mask="0x00000002" caption="When set to 1 will start programming EFUSE"/>
          <bitfield name="FIRST_READ_COUNT" mask="0x000007FC" caption="First Read Count"/>
          <bitfield name="FIRST_PROG_COUNT" mask="0x00007800" caption="First Program Count"/>
          <bitfield name="PROG_CLK_H_COUNT" mask="0x00FF8000" caption="First Clock High Count"/>
          <bitfield name="DEBUG_BUS_SEL" mask="0x07000000" caption="EFUSE Debug Bus Selection"/>
          <bitfield name="EFUSE_LOAD_DONE" mask="0x80000000" caption="Efuse Load Done Indication"/>
        </register>
        <register name="EFUSE_1_PROG_0" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="EFUSE_1_0 Program Register">
          <bitfield name="EFUSE_1_PROG_0" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_1_PROG_1" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="EFUSE_1_1 Program Register">
          <bitfield name="EFUSE_1_PROG_1" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_1_PROG_2" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="EFUSE_1_2 Program Register">
          <bitfield name="EFUSE_1_PROG_2" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_1_PROG_3" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="EFUSE_1_3 Program Register">
          <bitfield name="EFUSE_1_PROG_3" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_1_STATUS_0" offset="0x2C" rw="R" size="4" initval="0x00000000" caption="EFUSE_1_0 Status">
          <bitfield name="EFUSE_1_STATUS_0" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_1_STATUS_1" offset="0x30" rw="R" size="4" initval="0x00000000" caption="EFUSE_1_1 Status">
          <bitfield name="EFUSE_1_STATUS_1" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_1_STATUS_2" offset="0x34" rw="R" size="4" initval="0x00000000" caption="EFUSE_1_2 Status">
          <bitfield name="EFUSE_1_STATUS_2" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_1_STATUS_3" offset="0x38" rw="R" size="4" initval="0x00000000" caption="EFUSE_1_3 Status">
          <bitfield name="EFUSE_1_STATUS_3" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_2_PROG_0" offset="0x3C" rw="RW" size="4" initval="0x00000000" caption="EFUSE_2_0 Program Register">
          <bitfield name="EFUSE_2_PROG_0" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_2_PROG_1" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="EFUSE_2_1 Program Register">
          <bitfield name="EFUSE_2_PROG_1" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_2_PROG_2" offset="0x44" rw="RW" size="4" initval="0x00000000" caption="EFUSE_2_2 Program Register">
          <bitfield name="EFUSE_2_PROG_2" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_2_PROG_3" offset="0x48" rw="RW" size="4" initval="0x00000000" caption="EFUSE_2_3 Program Register">
          <bitfield name="EFUSE_2_PROG_3" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_2_STATUS_0" offset="0x4C" rw="R" size="4" initval="0x00000000" caption="EFUSE_2_0 Status">
          <bitfield name="EFUSE_2_STATUS_0" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_2_STATUS_1" offset="0x50" rw="R" size="4" initval="0x00000000" caption="EFUSE_2_1 Status">
          <bitfield name="EFUSE_2_STATUS_1" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_2_STATUS_2" offset="0x54" rw="R" size="4" initval="0x00000000" caption="EFUSE_2_2 Status">
          <bitfield name="EFUSE_2_STATUS_2" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_2_STATUS_3" offset="0x58" rw="R" size="4" initval="0x00000000" caption="EFUSE_2_3 Status">
          <bitfield name="EFUSE_2_STATUS_3" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_3_PROG_0" offset="0x5C" rw="RW" size="4" initval="0x00000000" caption="EFUSE_3_0 Program Register">
          <bitfield name="EFUSE_3_PROG_0" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_3_PROG_1" offset="0x60" rw="RW" size="4" initval="0x00000000" caption="EFUSE_3_1 Program Register">
          <bitfield name="EFUSE_3_PROG_1" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_3_PROG_2" offset="0x64" rw="RW" size="4" initval="0x00000000" caption="EFUSE_3_2 Program Register">
          <bitfield name="EFUSE_3_PROG_2" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_3_PROG_3" offset="0x68" rw="RW" size="4" initval="0x00000000" caption="EFUSE_3_3 Program Register">
          <bitfield name="EFUSE_3_PROG_3" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_3_STATUS_0" offset="0x6C" rw="R" size="4" initval="0x00000000" caption="EFUSE_3_0 Status">
          <bitfield name="EFUSE_3_STATUS_0" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_3_STATUS_1" offset="0x70" rw="R" size="4" initval="0x00000000" caption="EFUSE_3_1 Status">
          <bitfield name="EFUSE_3_STATUS_1" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_3_STATUS_2" offset="0x74" rw="R" size="4" initval="0x00000000" caption="EFUSE_3_2 Status">
          <bitfield name="EFUSE_3_STATUS_2" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_3_STATUS_3" offset="0x78" rw="R" size="4" initval="0x00000000" caption="EFUSE_3_3 Status">
          <bitfield name="EFUSE_3_STATUS_3" mask="0xFFFFFFFF"/>
        </register>
