Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11ZR.atdf
        <register name="LPMCU_GLOBAL_RESET_1" offset="0x8" rw="RW" size="2" initval="0xFFF" caption="Active Low Global Reset">
          <bitfield name="DUALTIMER0_RSTN" mask="0x001" caption="DUALTIMER0 Reset"/>
          <bitfield name="I2C1_CORE_RSTN" mask="0x002" caption="I2C1 Core Reset"/>
          <bitfield name="I2C1_IF_RSTN" mask="0x004" caption="I2C1 Interface Reset"/>
          <bitfield name="SECURITY_SHA_CORE_RSTN" mask="0x008" caption="Security SHA Core Reset"/>
          <bitfield name="SECURITY_SHA_AHB_RSTN" mask="0x010" caption="Security SHA AHB Interface Reset"/>
          <bitfield name="SECURITY_AES_CORE_RSTN" mask="0x020" caption="Security AES Core Reset"/>
          <bitfield name="SECURITY_AES_AHB_RSTN" mask="0x040" caption="Security AES AHB Interface Reset"/>
          <bitfield name="SPI0_SCK_CLK_RSTN" mask="0x080" caption="SPI0 SCK Clock Reset"/>
          <bitfield name="SPI1_SCK_CLK_RSTN" mask="0x100" caption="SPI1 SCK Clock Reset"/>
          <bitfield name="SPI0_SCK_PHASE_INT_CLK_RSTN" mask="0x200" caption="SPI0 SCK Phase Clock Reset"/>
          <bitfield name="SPI1_SCK_PHASE_INT_CLK_RSTN" mask="0x400" caption="SPI1 SCK Phase Clock Reset"/>
          <bitfield name="PROV_DMA_CTRL0_RSTN" mask="0x800" caption="PROV_DMA_CTRL0 Reset"/>
        </register>
        <register name="LPMCU_CLOCK_ENABLES_0" offset="0xC" rw="RW" size="4" initval="0x627FF9BE" caption="LPMCU Clock Enables">
          <bitfield name="SPI_FLASH0_CLK_EN" mask="0x00000002" caption="SPI_FLASH0 Clock Enable"/>
          <bitfield name="SPI0_CORE_CLK_EN" mask="0x00000004" caption="SPI0 Core Clock Enable"/>
          <bitfield name="SPI1_CORE_CLK_EN" mask="0x00000008" caption="SPI1 Core Clock Enable"/>
          <bitfield name="I2C0_CORE_CLK_EN" mask="0x00000010" caption="I2C0 Core Clock Enable"/>
          <bitfield name="DUALTIMER0_CLK_EN" mask="0x00000020" caption="DUALTIMER0 Clock Enable"/>
          <bitfield name="GPIO_CLK_EN" mask="0x00000080" caption="GPIO Controller Clock Enable"/>
          <bitfield name="TIMER0_CLK_EN" mask="0x00000100" caption="TIMER0 Clock Enable"/>
          <bitfield name="WDT0_CLK_EN" mask="0x00000800" caption="WDT0 Clock Enable"/>
          <bitfield name="WDT1_CLK_EN" mask="0x00001000" caption="WDT1 Clock Enable"/>
          <bitfield name="UART0_CORE_CLK_EN" mask="0x00002000" caption="UART0 Core Clock Enable"/>
          <bitfield name="UART0_IF_CLK_EN" mask="0x00004000" caption="UART0 Interface Clock Enable"/>
          <bitfield name="UART1_CORE_CLK_EN" mask="0x00008000" caption="UART1 Core Clock Enable"/>
          <bitfield name="UART1_IF_CLK_EN" mask="0x00010000" caption="UART1 Interface Clock Enable"/>
          <bitfield name="IRQ_CTRLR_CORE_CLK_EN" mask="0x00020000" caption="NVIC Clock Enable"/>
          <bitfield name="IDRAM_1_GL_MEM_CLK_EN" mask="0x00040000" caption="IDRAM1 Glue Logic Clock Enable"/>
          <bitfield name="IDRAM_2_GL_MEM_CLK_EN" mask="0x00080000" caption="IDRAM2 Glue Logic Clock Enable"/>
          <bitfield name="ROM_MEM_CLK_EN" mask="0x00100000" caption="ROM Clock Enable"/>
          <bitfield name="CALIB_XBAR_IF_CLK_EN" mask="0x00200000" caption="Low Power Clock Calibration Interface Clock Enable"/>
          <bitfield name="AON_WRAPPER_CLK_EN" mask="0x00400000" caption="AON Wrapper Clock Enable"/>
          <bitfield name="ARM_PCLK_EN" mask="0x00800000" caption="ARM PCLK Clock Enable (override)"/>
          <bitfield name="ARM_PCLKG_EN" mask="0x01000000" caption="ARM Gated PCLK Clock Enable (override)"/>
          <bitfield name="BLE_MEM_CLK_EN" mask="0x02000000" caption="ARM BLE 8K Retention Memory Clock Enable"/>
          <bitfield name="QUAD_DEC0_CLK_EN" mask="0x04000000" caption="QUAD_DEC0 Clock Enable"/>
          <bitfield name="QUAD_DEC1_CLK_EN" mask="0x08000000" caption="QUAD_DEC1 Clock Enable"/>
          <bitfield name="QUAD_DEC2_CLK_EN" mask="0x10000000" caption="QUAD_DEC2 Clock Enable"/>
          <bitfield name="I2C1_CORE_CLK_EN" mask="0x20000000" caption="I2C1 Core Clock Enable"/>
          <bitfield name="CALIB_CLK_EN" mask="0x40000000" caption="Low Power Clock Calibration Core Clock Enable"/>
        </register>
        <register name="LPMCU_CLOCK_ENABLES_1" offset="0x10" rw="RW" size="4" initval="0xF8783F" caption="LPMCU Clock Enables">
          <bitfield name="EFUSE0_CLK_EN" mask="0x000001" caption="EFUSE0 Clock Enable"/>
          <bitfield name="EFUSE1_CLK_EN" mask="0x000002" caption="EFUSE1 Clock Enable"/>
          <bitfield name="EFUSE2_CLK_EN" mask="0x000004" caption="EFUSE2 Clock Enable"/>
          <bitfield name="EFUSE3_CLK_EN" mask="0x000008" caption="EFUSE3 Clock Enable"/>
          <bitfield name="EFUSE4_CLK_EN" mask="0x000010" caption="EFUSE4 Clock Enable"/>
          <bitfield name="EFUSE5_CLK_EN" mask="0x000020" caption="EFUSE5 Clock Enable"/>
          <bitfield name="PWM0_CLK_EN" mask="0x000040" caption="PWM0 Clock Enable"/>
          <bitfield name="PWM1_CLK_EN" mask="0x000080" caption="PWM1 Clock Enable"/>
          <bitfield name="PWM2_CLK_EN" mask="0x000100" caption="PWM2 Clock Enable"/>
          <bitfield name="PWM3_CLK_EN" mask="0x000200" caption="PWM3 Clock Enable"/>
          <bitfield name="SENS_ADC_CLK_EN" mask="0x000400" caption="PMU Sensor ADC Clock Enable"/>
          <bitfield name="SPI0_SCK_PHASE_INT_CLK_EN" mask="0x000800" caption="SPI0 SCK Phase Internal Clock Enable"/>
          <bitfield name="SPI1_SCK_PHASE_INT_CLK_EN" mask="0x001000" caption="SPI1 SCK Phase Internal Clock Enable"/>
          <bitfield name="GPIO_GCLK_EN" mask="0x002000" caption="GPIO Controller Clock Enable"/>
          <bitfield name="TIMER0_PGCLK_EN" mask="0x004000" caption="TIMER0 Gated APB Clock"/>
          <bitfield name="SHA_CORE_CLK_EN" mask="0x008000" caption="SHA Core Clock Enable"/>
          <bitfield name="SHA_AHB_CLK_EN" mask="0x010000" caption="SHA AHB Clock Enable"/>
          <bitfield name="AES_CORE_CLK_EN" mask="0x020000" caption="AES Core Clock Enable"/>
          <bitfield name="AES_AHB_CLK_EN" mask="0x040000" caption="AES AHB Clock Enable"/>
          <bitfield name="IDRAM_1_0_MEM_CLK_EN" mask="0x080000" caption="IDRAM1_0 Memory Clock Enable"/>
          <bitfield name="IDRAM_1_1_MEM_CLK_EN" mask="0x100000" caption="IDRAM1_1 Memory Clock Enable"/>
          <bitfield name="IDRAM_1_2_MEM_CLK_EN" mask="0x200000" caption="IDRAM1_2 Memory Clock Enable"/>
          <bitfield name="IDRAM_2_0_MEM_CLK_EN" mask="0x400000" caption="IDRAM2_0 Memory Clock Enable"/>
          <bitfield name="IDRAM_2_1_MEM_CLK_EN" mask="0x800000" caption="IDRAM2_1 Memory Clock Enable"/>
        </register>
