Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11ZR.atdf
        <register name="BTMCU_CTRL" offset="0x14" rw="RW" size="1" initval="0x7" caption="Miscellaneous BLE control">
          <bitfield name="RXTX_SEQ_CLK_EN" mask="0x1" caption="BLE RXTX Sequencer Clock Enable"/>
          <bitfield name="AHB_CLK_EN" mask="0x2" caption="BLE HAB Clock Enable"/>
          <bitfield name="PERIPH_REGS_CLK_EN" mask="0x4" caption="BLE Periph Regs Clock Enable"/>
        </register>
        <register name="LPMCU_CTRL" offset="0x18" rw="RW" size="4" initval="0x00303100" caption="Miscellaneous LPMCU control">
          <bitfield name="LPMCU_CLK_SEL" mask="0x00000003" values="LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL" caption="LPMCU Clock Frequency Selection"/>
          <bitfield name="USE_BT26M_CLK" mask="0x00000004" caption="Use XO as ARM clock (must also set use_arm_lp_clk)"/>
          <bitfield name="USE_ARM_LP_CLK" mask="0x00000008" caption="Use either LP 2MHz clock or XO as ARM clock"/>
          <bitfield name="DUALTIMER0_CLK_SEL" mask="0x00000030" values="LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL" caption="DUALTIMER0 Clock Frequency Select"/>
          <bitfield name="BYPASS_WIC" mask="0x00000100" caption="Bypass Wakeup Interrupt Controller"/>
          <bitfield name="USE_XO_FOR_LP_CAL_CLK" mask="0x00000200" caption="Use the XO for Low Power Clock Calibration"/>
          <bitfield name="SPI_FLASH0_CLKSEL" mask="0x00003000" values="LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL" caption="SPI_FLASH0 Clock Frequency Select"/>
          <bitfield name="SPI_FLASH0_DIV_CLK_SEL" mask="0x00010000" caption="Use Generated Divided Clock for SPI_FLASH0"/>
          <bitfield name="IDRAM_1_MEM_IQ_BYP_EN" mask="0x00080000" caption="Mux Control to select between FECE and standard IDRAM memory. Default to IDRAM ARM Memory"/>
          <bitfield name="SPI_FLASH0_CLOCK_DIV_VALUE" mask="0x0FF00000" caption="Integer divider value. 26mhz clock will be divided by this register value "/>
          <bitfield name="INVERT_UART0_IF_CLK" mask="0x10000000" caption="Inverts UART0 interface clock  "/>
          <bitfield name="INVERT_UART1_IF_CLK" mask="0x20000000" caption="Inverts UART1 interface clock  "/>
        </register>
        <register name="LPMCU_MBIST" offset="0x1C" rw="RW" size="1" initval="0x0" caption="MBIST designation">
          <bitfield name="MBIST_MODE" mask="0x1" caption="Puts the chip in MBIST mode"/>
        </register>
        <register name="BLE_CTRL" offset="0x20" rw="RW" size="1" initval="0x0" caption="BLE Control">
          <bitfield name="BLE_WAKEUP_REQ" mask="0x1" caption="BLE Wakeup Request (to BLE Sleep Timer)"/>
          <bitfield name="BLE_WAKEUP_REQ_CORE" mask="0x2" caption="BLE Wakeup Request (to BLE Core)"/>
        </register>
        <register name="MBIST_CTRL" offset="0x24" rw="RW" size="4" initval="0x00000" caption="MBIST Control Register">
          <bitfield name="MBIST_CONTROL" mask="0x7FFFF"/>
        </register>
        <register name="MBIST_STATUS" offset="0x28" rw="R" size="4" initval="0x00000000" caption="MBIST Status Register">
          <bitfield name="MBIST_BUS" mask="0x001FFFFF" caption="Observation of MBIST results"/>
          <bitfield name="MBIST_BLOCK_SEL" mask="0x03E00000" caption="Observation of block field of MBIST control"/>
          <bitfield name="MBIST_WRAPPER_SEL" mask="0x7C000000" caption="Observation of wrapper field of MBIST control"/>
          <bitfield name="MBIST_MODE" mask="0x80000000" caption="Observation of mbist_mode signal"/>
        </register>
        <register name="MBIST_SRAM_ALG_SEL" offset="0x2C" rw="RW" size="2" initval="0x004F" caption="Enables MBIST algorithms">
          <bitfield name="MARCH2_ENABLE" mask="0x0001" caption="Enables the march2 algorithm"/>
          <bitfield name="UNIQUE_ENABLE" mask="0x0002" caption="Enables the unique address algorithm"/>
          <bitfield name="CHECKERBOARD_ENABLE" mask="0x0004" caption="Enables the checkerboard algorithm"/>
          <bitfield name="DIAGONAL_ENABLE" mask="0x0008" caption="Enables the diagonal algorithm"/>
          <bitfield name="ADDRDEC0_ENABLE" mask="0x0010" caption="Enables the address decoder bg0 algorithm"/>
          <bitfield name="ADDRDEC1_ENABLE" mask="0x0020" caption="Enables the address decoder bg1 algorithm"/>
          <bitfield name="COLMARCH1_ENABLE" mask="0x0040" caption="Enables the col_march1 algorithm"/>
          <bitfield name="FILLWITH0_ENABLE" mask="0x0080" caption="Enables the fillwith0 algorithm"/>
          <bitfield name="RET_READ_ZEROS_ENABLE" mask="0x0100" caption="Enables the ret read zeros algorithm"/>
          <bitfield name="RET_WRITE_ZEROS_ENABLE" mask="0x0200" caption="Enables the ret write zeros algorithm"/>
          <bitfield name="RET_READ_ONES_ENABLE" mask="0x0400" caption="Enables the ret read ones algorithm"/>
          <bitfield name="RET_WRITE_ONES_ENABLE" mask="0x0800" caption="Enables the ret write ones algorithm"/>
          <bitfield name="RET_READ_CB_ENABLE" mask="0x1000" caption="Enables the ret read checkerboard algorithm"/>
          <bitfield name="RET_WRITE_CB_ENABLE" mask="0x2000" caption="Enables the ret write checkerboard algorithm"/>
          <bitfield name="RET_READ_INVCB_ENABLE" mask="0x4000" caption="Enables the ret read inv checkerboard algorithm"/>
          <bitfield name="RET_WRITE_INVCB_ENABLE" mask="0x8000" caption="Enables the ret write inv checkerboard algorithm"/>
        </register>
        <register name="MBIST_BG" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="MBIST Background for MARCH2 algorithm (bits 31:0)">
          <bitfield name="MBIST_BG" mask="0xFFFFFFFF"/>
        </register>
        <register name="TEST_BUS_CTRL" offset="0x38" rw="RW" size="1" initval="0x0" caption="Controls all of the test bus functionality">
          <bitfield name="TEST_ENABLE_ARM" mask="0x1" caption="Selects periph test bus"/>
        </register>
        <register name="WP3_MISR_DATAOUT" offset="0x3C" rw="R" size="4" initval="0x00000000" caption="ROM MBIST Signature">
          <bitfield name="WP3_MISR_DATAOUT" mask="0xFFFFFFFF"/>
        </register>
        <register name="INVERT_OUTPUT_CTRL" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="Invert Output Control">
          <bitfield name="LP_GPIO_0" mask="0x00000001" caption="Invert the output for lp_gpio_0"/>
          <bitfield name="LP_GPIO_1" mask="0x00000002" caption="Invert the output for lp_gpio_1"/>
          <bitfield name="LP_GPIO_2" mask="0x00000004" caption="Invert the output for lp_gpio_2"/>
          <bitfield name="LP_GPIO_3" mask="0x00000008" caption="Invert the output for lp_gpio_3"/>
          <bitfield name="LP_GPIO_4" mask="0x00000010" caption="Invert the output for lp_gpio_4"/>
          <bitfield name="LP_GPIO_5" mask="0x00000020" caption="Invert the output for lp_gpio_5"/>
          <bitfield name="LP_GPIO_6" mask="0x00000040" caption="Invert the output for lp_gpio_6"/>
          <bitfield name="LP_GPIO_7" mask="0x00000080" caption="Invert the output for lp_gpio_7"/>
          <bitfield name="LP_GPIO_8" mask="0x00000100" caption="Invert the output for lp_gpio_8"/>
          <bitfield name="LP_GPIO_9" mask="0x00000200" caption="Invert the output for lp_gpio_9"/>
          <bitfield name="LP_GPIO_10" mask="0x00000400" caption="Invert the output for lp_gpio_10"/>
          <bitfield name="LP_GPIO_11" mask="0x00000800" caption="Invert the output for lp_gpio_11"/>
          <bitfield name="LP_GPIO_12" mask="0x00001000" caption="Invert the output for lp_gpio_12"/>
          <bitfield name="LP_GPIO_13" mask="0x00002000" caption="Invert the output for lp_gpio_13"/>
          <bitfield name="LP_GPIO_14" mask="0x00004000" caption="Invert the output for lp_gpio_14"/>
          <bitfield name="LP_GPIO_15" mask="0x00008000" caption="Invert the output for lp_gpio_15"/>
          <bitfield name="LP_GPIO_16" mask="0x00010000" caption="Invert the output for lp_gpio_16"/>
          <bitfield name="LP_GPIO_17" mask="0x00020000" caption="Invert the output for lp_gpio_17"/>
          <bitfield name="LP_GPIO_18" mask="0x00040000" caption="Invert the output for lp_gpio_18"/>
          <bitfield name="LP_GPIO_19" mask="0x00080000" caption="Invert the output for lp_gpio_19"/>
          <bitfield name="LP_GPIO_20" mask="0x00100000" caption="Invert the output for lp_gpio_20"/>
          <bitfield name="LP_GPIO_21" mask="0x00200000" caption="Invert the output for lp_gpio_21"/>
          <bitfield name="LP_GPIO_22" mask="0x00400000" caption="Invert the output for lp_gpio_22"/>
          <bitfield name="LP_GPIO_23" mask="0x00800000" caption="Invert the output for lp_gpio_23"/>
          <bitfield name="LP_SIP_0" mask="0x08000000" caption="Invert the output for lp_sip_0"/>
          <bitfield name="LP_SIP_1" mask="0x10000000" caption="Invert the output for lp_sip_1"/>
          <bitfield name="LP_SIP_2" mask="0x20000000" caption="Invert the output for lp_sip_2"/>
          <bitfield name="LP_SIP_3" mask="0x40000000" caption="Invert the output for lp_sip_3"/>
          <bitfield name="LP_SIP_4" mask="0x80000000" caption="Invert the output for lp_sip_4"/>
        </register>
        <register name="PINMUX_SEL_0" offset="0x44" rw="RW" size="4" initval="0x00000022" caption="Pinmux select for LP_GPIO_0, LP_GPIO_1, LP_GPIO_2, LP_GPIO_3, LP_GPIO_4, LP_GPIO_5, LP_GPIO_6, LP_GPIO_7">
          <bitfield name="LP_GPIO_0_SEL" mask="0x00000007" values="LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL" caption="Pinmux select for LP_GPIO_0"/>
          <bitfield name="LP_GPIO_1_SEL" mask="0x00000070" values="LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL" caption="Pinmux select for LP_GPIO_1"/>
          <bitfield name="LP_GPIO_2_SEL" mask="0x00000700" values="LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL" caption="Pinmux select for LP_GPIO_2"/>
          <bitfield name="LP_GPIO_3_SEL" mask="0x00007000" values="LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL" caption="Pinmux select for LP_GPIO_3"/>
          <bitfield name="LP_GPIO_4_SEL" mask="0x00070000" values="LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL" caption="Pinmux select for LP_GPIO_4"/>
          <bitfield name="LP_GPIO_5_SEL" mask="0x00700000" values="LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL" caption="Pinmux select for LP_GPIO_5"/>
          <bitfield name="LP_GPIO_6_SEL" mask="0x07000000" values="LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL" caption="Pinmux select for LP_GPIO_6"/>
          <bitfield name="LP_GPIO_7_SEL" mask="0x70000000" values="LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL" caption="Pinmux select for LP_GPIO_7"/>
        </register>
        <register name="PINMUX_SEL_1" offset="0x48" rw="RW" size="4" initval="0x00000033" caption="Pinmux select for LP_GPIO_8, LP_GPIO_9, LP_GPIO_10, LP_GPIO_11, LP_GPIO_12, LP_GPIO_13, LP_GPIO_14, LP_GPIO_15">
          <bitfield name="LP_GPIO_8_SEL" mask="0x00000007" values="LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL" caption="Pinmux select for LP_GPIO_8"/>
          <bitfield name="LP_GPIO_9_SEL" mask="0x00000070" values="LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL" caption="Pinmux select for LP_GPIO_9"/>
          <bitfield name="LP_GPIO_10_SEL" mask="0x00000700" values="LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL" caption="Pinmux select for LP_GPIO_10"/>
          <bitfield name="LP_GPIO_11_SEL" mask="0x00007000" values="LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL" caption="Pinmux select for LP_GPIO_11"/>
          <bitfield name="LP_GPIO_12_SEL" mask="0x00070000" values="LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL" caption="Pinmux select for LP_GPIO_12"/>
          <bitfield name="LP_GPIO_13_SEL" mask="0x00700000" values="LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL" caption="Pinmux select for LP_GPIO_13"/>
          <bitfield name="LP_GPIO_14_SEL" mask="0x07000000" values="LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL" caption="Pinmux select for LP_GPIO_14"/>
          <bitfield name="LP_GPIO_15_SEL" mask="0x70000000" values="LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL" caption="Pinmux select for LP_GPIO_15"/>
        </register>
