Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11ZR.atdf
        <register name="EFUSE_1_STATUS_3" offset="0x204" rw="RW" size="4" initval="0x00000000" caption="EFUSE_1_3 Status">
          <bitfield name="EFUSE_1_STATUS_3" mask="0xFFFFFFFF"/>
        </register>
        <register name="LPMCU_FORCE_CTRL" offset="0x210" rw="RW" size="2" initval="0x0F7F" caption="Miscellaneous Force control values for LPMCU">
          <bitfield name="SCLK_EN" mask="0x0001" caption="Enable Force Control of SCLK"/>
          <bitfield name="SCLK_VAL" mask="0x0002" caption="Enable Force Control of SCLK Value"/>
          <bitfield name="DCLK_EN" mask="0x0004" caption="Enable Force Control of DCLK"/>
          <bitfield name="DCLK_VAL" mask="0x0008" caption="Enable Force Control of DCLK Value"/>
          <bitfield name="PCLKG_EN" mask="0x0010" caption="Enable Force Control of PCLKG"/>
          <bitfield name="PCLKG_VAL" mask="0x0020" caption="Enable Force Control of PCLKG Value"/>
          <bitfield name="WICENREQ_EN" mask="0x0040" caption="Enable Force Control of WIC Enable Request to use WIC during Sleep Conditions"/>
          <bitfield name="WICENREQ_VAL" mask="0x0080" caption="Enable Force Control of WIC Enable Value"/>
          <bitfield name="GPIO_GCLK_EN" mask="0x0100" caption="Enable Force Control of GPIO Modules Clk (override clock gating and enable)"/>
          <bitfield name="COUNTER_PGCLK_EN" mask="0x0200" caption="Enable Force Control of Counter Modules Clk (override clock gating and enable)"/>
          <bitfield name="DUALTIMER_PGCLK_EN" mask="0x0400" caption="Enable Force Control of DualTimer Modules PGClk (override clock gating and enable)"/>
          <bitfield name="WICENACK_EN" mask="0x0800" caption="Enable Force Control of WIC ACK to use WIC during Sleep Conditions - Requires Handshake from WIC when its ok to sleep"/>
          <bitfield name="WICENACK_VAL" mask="0x1000" caption="Enable Force Control of WIC Enable Value - Requires Handshake from WIC when its ok to sleep"/>
        </register>
        <register name="ARM_IRQ_STATUS_0" offset="0x214" rw="R" size="4" initval="0x00000000" caption="ARM Cortex M0 IRQ Status">
          <bitfield name="ARM_IRQ_STATUS_0" mask="0xFFFFFFFF"/>
        </register>
        <register name="ARM_IRQ_STATUS_1" offset="0x218" rw="R" size="4" initval="0x00000000" caption="ARM Cortex M0 IRQ Status">
          <bitfield name="ARM_IRQ_STATUS_1" mask="0xFFFFFFFF"/>
        </register>
        <register name="BLE_DEEP_SLEEP_ENABLES" offset="0x240" rw="RW" size="1" initval="0x1" caption="BLE Deep Sleep Enables">
          <bitfield name="FW_TIMER_CORR_EN" mask="0x1" caption="Enables FW Timer Correction Operation"/>
          <bitfield name="HW_TIMER_CORR_EN" mask="0x2" caption="Enables HW Timer Correction Operation"/>
        </register>
        <register name="DEEP_SLEEP_HW_TIMER_CORR" offset="0x244" rw="RW" size="4" initval="0x0F424000" caption="Configures the HW auto correction algorithm of the fine/base timers after wakeup from deep sleep">
          <bitfield name="WAIT" mask="0x000003FF" caption="Wait time in us after wakeup before correction begins"/>
          <bitfield name="RTC_TOSC" mask="0x3FFFF000" caption="Period of RTC clock in us [7.11]"/>
        </register>
        <register name="REMAP_IDRAM1_BASE_ADDR" offset="0x254" rw="RW" size="4" initval="0x00008000" caption="ARM Cortex M0 idram 1 remap base addr">
          <bitfield name="REMAP_IDRAM1_BASE_ADDR" mask="0xFFFFFFFF"/>
        </register>
        <register name="REMAP_IDRAM1_END_ADDR" offset="0x258" rw="RW" size="4" initval="0x0001FFFF" caption="ARM Cortex M0 idram 1 remap end addr">
          <bitfield name="REMAP_IDRAM1_END_ADDR" mask="0xFFFFFFFF"/>
        </register>
        <register name="REMAP_IDRAM2_BASE_ADDR" offset="0x25C" rw="RW" size="4" initval="0x00000000" caption="ARM Cortex M0 idram 2 remap base addr">
          <bitfield name="REMAP_IDRAM2_BASE_ADDR" mask="0xFFFFFFFF"/>
        </register>
        <register name="REMAP_IDRAM2_END_ADDR" offset="0x260" rw="RW" size="4" initval="0x00007FFF" caption="ARM Cortex M0 idram 2 remap end addr">
          <bitfield name="REMAP_IDRAM2_END_ADDR" mask="0xFFFFFFFF"/>
        </register>
        <register name="REMAP_BOOT_BASE_ADDR" offset="0x264" rw="RW" size="4" initval="0x10000000" caption="ARM Cortex M0 bootrom remap base addr">
          <bitfield name="REMAP_BOOT_BASE_ADDR" mask="0xFFFFFFFF"/>
        </register>
        <register name="REMAP_BOOT_END_ADDR" offset="0x268" rw="RW" size="4" initval="0x1001FFFF" caption="ARM Cortex M0 bootrom remap end addr">
          <bitfield name="REMAP_BOOT_END_ADDR" mask="0xFFFFFFFF"/>
        </register>
        <register name="QUAD_DEC_IRQS" offset="0x280" rw="R" size="1" initval="0x0" caption="Reflects the IRQ status of the Quad Decoders">
          <bitfield name="QUAD_DEC0_IRQ" mask="0x1" caption="QUAD_DEC0 Interrupt"/>
          <bitfield name="QUAD_DEC1_IRQ" mask="0x2" caption="QUAD_DEC1 Interrupt"/>
          <bitfield name="QUAD_DEC2_IRQ" mask="0x4" caption="QUAD_DEC2 Interrupt"/>
        </register>
        <register name="QUAD_DEC0_STATUS" offset="0x284" rw="R" size="2" initval="0x0000" caption="Current status of QUAD_DEC0">
          <bitfield name="COUNT" mask="0xFFFF" caption="Current count of QUAD_DEC0"/>
        </register>
        <register name="QUAD_DEC1_STATUS" offset="0x288" rw="R" size="2" initval="0x0000" caption="Current status of QUAD_DEC1">
          <bitfield name="COUNT" mask="0xFFFF" caption="Current count of QUAD_DEC1"/>
        </register>
        <register name="QUAD_DEC2_STATUS" offset="0x28C" rw="R" size="2" initval="0x0000" caption="Current status of QUAD_DEC2">
          <bitfield name="COUNT" mask="0xFFFF" caption="Current count of QUAD_DEC2"/>
        </register>
        <register name="QUAD_DEC0_THRESHOLD" offset="0x290" rw="RW" size="4" initval="0x00FFFF00" caption="Thresholds for QUAD_DEC0">
          <bitfield name="UPPER" mask="0x0000FFFF" caption="Upper Threshold of counter for QUAD_DEC0"/>
          <bitfield name="LOWER" mask="0xFFFF0000" caption="Lower Threshold of counter for QUAD_DEC0"/>
        </register>
        <register name="QUAD_DEC0_CTRL" offset="0x294" rw="RW" size="1" initval="0x0" caption="Control for QUAD_DEC0">
          <bitfield name="ENABLE" mask="0x1" caption="Enable Quad Decoder"/>
          <bitfield name="CLR_IRQ" mask="0x2" caption="Clear IRQ From Quad Decoder"/>
          <bitfield name="CLOCK_SEL" mask="0xC" values="LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL" caption="Quad Decoder Source Clock Frequency Select"/>
        </register>
        <register name="QUAD_DEC1_THRESHOLD" offset="0x2A0" rw="RW" size="4" initval="0x00FFFF00" caption="Thresholds for QUAD_DEC1">
          <bitfield name="UPPER" mask="0x0000FFFF" caption="Upper Threshold of counter for QUAD_DEC1"/>
          <bitfield name="LOWER" mask="0xFFFF0000" caption="Lower Threshold of counter for QUAD_DEC1"/>
        </register>
