Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11ZR.atdf
      <value-group name="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4">
        <value name="0" caption="SPI0 RX" value="0x0"/>
        <value name="1" caption="UART0 RX" value="0x1"/>
        <value name="2" caption="UART0 TX" value="0x2"/>
        <value name="3" caption="UART1 RX" value="0x3"/>
        <value name="4" caption="UART1 TX" value="0x4"/>
        <value name="5" caption="SPI0 RX" value="0x5"/>
        <value name="6" caption="SPI0 TX" value="0x6"/>
        <value name="7" caption="SPI1 RX" value="0x7"/>
        <value name="8" caption="SPI1 TX" value="0x8"/>
        <value name="9" caption="I2C0 RX" value="0x9"/>
        <value name="10" caption="I2C0 TX" value="0xa"/>
        <value name="11" caption="I2C1 RX" value="0xb"/>
        <value name="12" caption="I2C1 TX" value="0xc"/>
        <value name="13" caption="WDT0" value="0xd"/>
        <value name="14" caption="WDT1" value="0xe"/>
        <value name="15" caption="DUALTIMER0" value="0xf"/>
        <value name="16" caption="PROV_DMA_CTRL0" value="0x10"/>
        <value name="17" caption="SECURITY" value="0x11"/>
        <value name="18" caption="EFUSE_OUT_OF_RESET" value="0x12"/>
        <value name="19" caption="QUAD_DEC0_1_2" value="0x13"/>
        <value name="20" caption="BLE_FRONTEND" value="0x14"/>
        <value name="21" caption="PROG_AHB_TRIG_TIMEOUT" value="0x15"/>
        <value name="22" caption="SXPLL_NEED_RESET" value="0x16"/>
        <value name="23" caption="LP_CLK_CAL_DONE" value="0x17"/>
        <value name="24" caption="BROWNOUT_DETECTED" value="0x18"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5">
        <value name="0" caption="SPI0 TX" value="0x0"/>
        <value name="1" caption="UART0 RX" value="0x1"/>
        <value name="2" caption="UART0 TX" value="0x2"/>
        <value name="3" caption="UART1 RX" value="0x3"/>
        <value name="4" caption="UART1 TX" value="0x4"/>
        <value name="5" caption="SPI0 RX" value="0x5"/>
        <value name="6" caption="SPI0 TX" value="0x6"/>
        <value name="7" caption="SPI1 RX" value="0x7"/>
        <value name="8" caption="SPI1 TX" value="0x8"/>
        <value name="9" caption="I2C0 RX" value="0x9"/>
        <value name="10" caption="I2C0 TX" value="0xa"/>
        <value name="11" caption="I2C1 RX" value="0xb"/>
        <value name="12" caption="I2C1 TX" value="0xc"/>
        <value name="13" caption="WDT0" value="0xd"/>
        <value name="14" caption="WDT1" value="0xe"/>
        <value name="15" caption="DUALTIMER0" value="0xf"/>
        <value name="16" caption="PROV_DMA_CTRL0" value="0x10"/>
        <value name="17" caption="SECURITY" value="0x11"/>
        <value name="18" caption="EFUSE_OUT_OF_RESET" value="0x12"/>
        <value name="19" caption="QUAD_DEC0_1_2" value="0x13"/>
        <value name="20" caption="BLE_FRONTEND" value="0x14"/>
        <value name="21" caption="PROG_AHB_TRIG_TIMEOUT" value="0x15"/>
        <value name="22" caption="SXPLL_NEED_RESET" value="0x16"/>
        <value name="23" caption="LP_CLK_CAL_DONE" value="0x17"/>
        <value name="24" caption="BROWNOUT_DETECTED" value="0x18"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6">
        <value name="0" caption="SPI1 RX" value="0x0"/>
        <value name="1" caption="UART0 RX" value="0x1"/>
        <value name="2" caption="UART0 TX" value="0x2"/>
        <value name="3" caption="UART1 RX" value="0x3"/>
        <value name="4" caption="UART1 TX" value="0x4"/>
        <value name="5" caption="SPI0 RX" value="0x5"/>
        <value name="6" caption="SPI0 TX" value="0x6"/>
        <value name="7" caption="SPI1 RX" value="0x7"/>
        <value name="8" caption="SPI1 TX" value="0x8"/>
        <value name="9" caption="I2C0 RX" value="0x9"/>
        <value name="10" caption="I2C0 TX" value="0xa"/>
        <value name="11" caption="I2C1 RX" value="0xb"/>
        <value name="12" caption="I2C1 TX" value="0xc"/>
        <value name="13" caption="WDT0" value="0xd"/>
        <value name="14" caption="WDT1" value="0xe"/>
        <value name="15" caption="DUALTIMER0" value="0xf"/>
        <value name="16" caption="PROV_DMA_CTRL0" value="0x10"/>
        <value name="17" caption="SECURITY" value="0x11"/>
        <value name="18" caption="EFUSE_OUT_OF_RESET" value="0x12"/>
        <value name="19" caption="QUAD_DEC0_1_2" value="0x13"/>
        <value name="20" caption="BLE_FRONTEND" value="0x14"/>
        <value name="21" caption="PROG_AHB_TRIG_TIMEOUT" value="0x15"/>
        <value name="22" caption="SXPLL_NEED_RESET" value="0x16"/>
        <value name="23" caption="LP_CLK_CAL_DONE" value="0x17"/>
        <value name="24" caption="BROWNOUT_DETECTED" value="0x18"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7">
        <value name="0" caption="SPI1 TX" value="0x0"/>
        <value name="1" caption="UART0 RX" value="0x1"/>
        <value name="2" caption="UART0 TX" value="0x2"/>
        <value name="3" caption="UART1 RX" value="0x3"/>
        <value name="4" caption="UART1 TX" value="0x4"/>
        <value name="5" caption="SPI0 RX" value="0x5"/>
        <value name="6" caption="SPI0 TX" value="0x6"/>
        <value name="7" caption="SPI1 RX" value="0x7"/>
        <value name="8" caption="SPI1 TX" value="0x8"/>
        <value name="9" caption="I2C0 RX" value="0x9"/>
        <value name="10" caption="I2C0 TX" value="0xa"/>
        <value name="11" caption="I2C1 RX" value="0xb"/>
        <value name="12" caption="I2C1 TX" value="0xc"/>
        <value name="13" caption="WDT0" value="0xd"/>
        <value name="14" caption="WDT1" value="0xe"/>
        <value name="15" caption="DUALTIMER0" value="0xf"/>
        <value name="16" caption="PROV_DMA_CTRL0" value="0x10"/>
        <value name="17" caption="SECURITY" value="0x11"/>
        <value name="18" caption="EFUSE_OUT_OF_RESET" value="0x12"/>
        <value name="19" caption="QUAD_DEC0_1_2" value="0x13"/>
        <value name="20" caption="BLE_FRONTEND" value="0x14"/>
        <value name="21" caption="PROG_AHB_TRIG_TIMEOUT" value="0x15"/>
        <value name="22" caption="SXPLL_NEED_RESET" value="0x16"/>
        <value name="23" caption="LP_CLK_CAL_DONE" value="0x17"/>
        <value name="24" caption="BROWNOUT_DETECTED" value="0x18"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8">
        <value name="0" caption="I2C0 RX" value="0x0"/>
        <value name="1" caption="UART0 RX" value="0x1"/>
        <value name="2" caption="UART0 TX" value="0x2"/>
        <value name="3" caption="UART1 RX" value="0x3"/>
        <value name="4" caption="UART1 TX" value="0x4"/>
        <value name="5" caption="SPI0 RX" value="0x5"/>
        <value name="6" caption="SPI0 TX" value="0x6"/>
        <value name="7" caption="SPI1 RX" value="0x7"/>
        <value name="8" caption="SPI1 TX" value="0x8"/>
        <value name="9" caption="I2C0 RX" value="0x9"/>
        <value name="10" caption="I2C0 TX" value="0xa"/>
        <value name="11" caption="I2C1 RX" value="0xb"/>
        <value name="12" caption="I2C1 TX" value="0xc"/>
        <value name="13" caption="WDT0" value="0xd"/>
        <value name="14" caption="WDT1" value="0xe"/>
        <value name="15" caption="DUALTIMER0" value="0xf"/>
        <value name="16" caption="PROV_DMA_CTRL0" value="0x10"/>
        <value name="17" caption="SECURITY" value="0x11"/>
        <value name="18" caption="EFUSE_OUT_OF_RESET" value="0x12"/>
        <value name="19" caption="QUAD_DEC0_1_2" value="0x13"/>
        <value name="20" caption="BLE_FRONTEND" value="0x14"/>
        <value name="21" caption="PROG_AHB_TRIG_TIMEOUT" value="0x15"/>
        <value name="22" caption="SXPLL_NEED_RESET" value="0x16"/>
        <value name="23" caption="LP_CLK_CAL_DONE" value="0x17"/>
        <value name="24" caption="BROWNOUT_DETECTED" value="0x18"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9">
        <value name="0" caption="I2C0 TX" value="0x0"/>
        <value name="1" caption="UART0 RX" value="0x1"/>
        <value name="2" caption="UART0 TX" value="0x2"/>
        <value name="3" caption="UART1 RX" value="0x3"/>
        <value name="4" caption="UART1 TX" value="0x4"/>
        <value name="5" caption="SPI0 RX" value="0x5"/>
        <value name="6" caption="SPI0 TX" value="0x6"/>
        <value name="7" caption="SPI1 RX" value="0x7"/>
        <value name="8" caption="SPI1 TX" value="0x8"/>
        <value name="9" caption="I2C0 RX" value="0x9"/>
        <value name="10" caption="I2C0 TX" value="0xa"/>
        <value name="11" caption="I2C1 RX" value="0xb"/>
        <value name="12" caption="I2C1 TX" value="0xc"/>
        <value name="13" caption="WDT0" value="0xd"/>
        <value name="14" caption="WDT1" value="0xe"/>
        <value name="15" caption="DUALTIMER0" value="0xf"/>
        <value name="16" caption="PROV_DMA_CTRL0" value="0x10"/>
        <value name="17" caption="SECURITY" value="0x11"/>
        <value name="18" caption="EFUSE_OUT_OF_RESET" value="0x12"/>
        <value name="19" caption="QUAD_DEC0_1_2" value="0x13"/>
        <value name="20" caption="BLE_FRONTEND" value="0x14"/>
        <value name="21" caption="PROG_AHB_TRIG_TIMEOUT" value="0x15"/>
        <value name="22" caption="SXPLL_NEED_RESET" value="0x16"/>
        <value name="23" caption="LP_CLK_CAL_DONE" value="0x17"/>
        <value name="24" caption="BROWNOUT_DETECTED" value="0x18"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10">
        <value name="0" caption="I2C1 RX" value="0x0"/>
        <value name="1" caption="UART0 RX" value="0x1"/>
        <value name="2" caption="UART0 TX" value="0x2"/>
        <value name="3" caption="UART1 RX" value="0x3"/>
        <value name="4" caption="UART1 TX" value="0x4"/>
        <value name="5" caption="SPI0 RX" value="0x5"/>
        <value name="6" caption="SPI0 TX" value="0x6"/>
        <value name="7" caption="SPI1 RX" value="0x7"/>
        <value name="8" caption="SPI1 TX" value="0x8"/>
        <value name="9" caption="I2C0 RX" value="0x9"/>
        <value name="10" caption="I2C0 TX" value="0xa"/>
        <value name="11" caption="I2C1 RX" value="0xb"/>
        <value name="12" caption="I2C1 TX" value="0xc"/>
        <value name="13" caption="WDT0" value="0xd"/>
        <value name="14" caption="WDT1" value="0xe"/>
        <value name="15" caption="DUALTIMER0" value="0xf"/>
        <value name="16" caption="PROV_DMA_CTRL0" value="0x10"/>
        <value name="17" caption="SECURITY" value="0x11"/>
        <value name="18" caption="EFUSE_OUT_OF_RESET" value="0x12"/>
        <value name="19" caption="QUAD_DEC0_1_2" value="0x13"/>
        <value name="20" caption="BLE_FRONTEND" value="0x14"/>
        <value name="21" caption="PROG_AHB_TRIG_TIMEOUT" value="0x15"/>
        <value name="22" caption="SXPLL_NEED_RESET" value="0x16"/>
        <value name="23" caption="LP_CLK_CAL_DONE" value="0x17"/>
        <value name="24" caption="BROWNOUT_DETECTED" value="0x18"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11">
        <value name="0" caption="I2C1 TX" value="0x0"/>
        <value name="1" caption="UART0 RX" value="0x1"/>
        <value name="2" caption="UART0 TX" value="0x2"/>
        <value name="3" caption="UART1 RX" value="0x3"/>
        <value name="4" caption="UART1 TX" value="0x4"/>
        <value name="5" caption="SPI0 RX" value="0x5"/>
        <value name="6" caption="SPI0 TX" value="0x6"/>
        <value name="7" caption="SPI1 RX" value="0x7"/>
        <value name="8" caption="SPI1 TX" value="0x8"/>
        <value name="9" caption="I2C0 RX" value="0x9"/>
        <value name="10" caption="I2C0 TX" value="0xa"/>
        <value name="11" caption="I2C1 RX" value="0xb"/>
        <value name="12" caption="I2C1 TX" value="0xc"/>
        <value name="13" caption="WDT0" value="0xd"/>
        <value name="14" caption="WDT1" value="0xe"/>
        <value name="15" caption="DUALTIMER0" value="0xf"/>
        <value name="16" caption="PROV_DMA_CTRL0" value="0x10"/>
        <value name="17" caption="SECURITY" value="0x11"/>
        <value name="18" caption="EFUSE_OUT_OF_RESET" value="0x12"/>
        <value name="19" caption="QUAD_DEC0_1_2" value="0x13"/>
        <value name="20" caption="BLE_FRONTEND" value="0x14"/>
        <value name="21" caption="PROG_AHB_TRIG_TIMEOUT" value="0x15"/>
        <value name="22" caption="SXPLL_NEED_RESET" value="0x16"/>
        <value name="23" caption="LP_CLK_CAL_DONE" value="0x17"/>
        <value name="24" caption="BROWNOUT_DETECTED" value="0x18"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12">
        <value name="0" caption="WDT0" value="0x0"/>
        <value name="1" caption="UART0 RX" value="0x1"/>
        <value name="2" caption="UART0 TX" value="0x2"/>
        <value name="3" caption="UART1 RX" value="0x3"/>
        <value name="4" caption="UART1 TX" value="0x4"/>
        <value name="5" caption="SPI0 RX" value="0x5"/>
        <value name="6" caption="SPI0 TX" value="0x6"/>
        <value name="7" caption="SPI1 RX" value="0x7"/>
        <value name="8" caption="SPI1 TX" value="0x8"/>
        <value name="9" caption="I2C0 RX" value="0x9"/>
        <value name="10" caption="I2C0 TX" value="0xa"/>
        <value name="11" caption="I2C1 RX" value="0xb"/>
        <value name="12" caption="I2C1 TX" value="0xc"/>
        <value name="13" caption="WDT0" value="0xd"/>
        <value name="14" caption="WDT1" value="0xe"/>
        <value name="15" caption="DUALTIMER0" value="0xf"/>
        <value name="16" caption="PROV_DMA_CTRL0" value="0x10"/>
        <value name="17" caption="SECURITY" value="0x11"/>
        <value name="18" caption="EFUSE_OUT_OF_RESET" value="0x12"/>
        <value name="19" caption="QUAD_DEC0_1_2" value="0x13"/>
        <value name="20" caption="BLE_FRONTEND" value="0x14"/>
        <value name="21" caption="PROG_AHB_TRIG_TIMEOUT" value="0x15"/>
        <value name="22" caption="SXPLL_NEED_RESET" value="0x16"/>
        <value name="23" caption="LP_CLK_CAL_DONE" value="0x17"/>
        <value name="24" caption="BROWNOUT_DETECTED" value="0x18"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13">
        <value name="0" caption="WDT1" value="0x0"/>
        <value name="1" caption="UART0 RX" value="0x1"/>
        <value name="2" caption="UART0 TX" value="0x2"/>
        <value name="3" caption="UART1 RX" value="0x3"/>
        <value name="4" caption="UART1 TX" value="0x4"/>
        <value name="5" caption="SPI0 RX" value="0x5"/>
        <value name="6" caption="SPI0 TX" value="0x6"/>
        <value name="7" caption="SPI1 RX" value="0x7"/>
        <value name="8" caption="SPI1 TX" value="0x8"/>
        <value name="9" caption="I2C0 RX" value="0x9"/>
        <value name="10" caption="I2C0 TX" value="0xa"/>
        <value name="11" caption="I2C1 RX" value="0xb"/>
        <value name="12" caption="I2C1 TX" value="0xc"/>
        <value name="13" caption="WDT0" value="0xd"/>
        <value name="14" caption="WDT1" value="0xe"/>
        <value name="15" caption="DUALTIMER0" value="0xf"/>
        <value name="16" caption="PROV_DMA_CTRL0" value="0x10"/>
        <value name="17" caption="SECURITY" value="0x11"/>
        <value name="18" caption="EFUSE_OUT_OF_RESET" value="0x12"/>
        <value name="19" caption="QUAD_DEC0_1_2" value="0x13"/>
        <value name="20" caption="BLE_FRONTEND" value="0x14"/>
        <value name="21" caption="PROG_AHB_TRIG_TIMEOUT" value="0x15"/>
        <value name="22" caption="SXPLL_NEED_RESET" value="0x16"/>
        <value name="23" caption="LP_CLK_CAL_DONE" value="0x17"/>
        <value name="24" caption="BROWNOUT_DETECTED" value="0x18"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14">
        <value name="0" caption="DUALTIMER0" value="0x0"/>
        <value name="1" caption="UART0 RX" value="0x1"/>
        <value name="2" caption="UART0 TX" value="0x2"/>
        <value name="3" caption="UART1 RX" value="0x3"/>
        <value name="4" caption="UART1 TX" value="0x4"/>
        <value name="5" caption="SPI0 RX" value="0x5"/>
        <value name="6" caption="SPI0 TX" value="0x6"/>
        <value name="7" caption="SPI1 RX" value="0x7"/>
        <value name="8" caption="SPI1 TX" value="0x8"/>
        <value name="9" caption="I2C0 RX" value="0x9"/>
        <value name="10" caption="I2C0 TX" value="0xa"/>
        <value name="11" caption="I2C1 RX" value="0xb"/>
        <value name="12" caption="I2C1 TX" value="0xc"/>
        <value name="13" caption="WDT0" value="0xd"/>
        <value name="14" caption="WDT1" value="0xe"/>
        <value name="15" caption="DUALTIMER0" value="0xf"/>
        <value name="16" caption="PROV_DMA_CTRL0" value="0x10"/>
        <value name="17" caption="SECURITY" value="0x11"/>
        <value name="18" caption="EFUSE_OUT_OF_RESET" value="0x12"/>
        <value name="19" caption="QUAD_DEC0_1_2" value="0x13"/>
        <value name="20" caption="BLE_FRONTEND" value="0x14"/>
        <value name="21" caption="PROG_AHB_TRIG_TIMEOUT" value="0x15"/>
        <value name="22" caption="SXPLL_NEED_RESET" value="0x16"/>
        <value name="23" caption="LP_CLK_CAL_DONE" value="0x17"/>
        <value name="24" caption="BROWNOUT_DETECTED" value="0x18"/>
      </value-group>
