Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11ZR.atdf
      <value-group name="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_3_LP_GPIO_14">
        <value name="UART0_RXD" caption="UART0_RXD" value="0x0"/>
        <value name="UART0_TXD" caption="UART0_TXD" value="0x1"/>
        <value name="UART0_CTS" caption="UART0_CTS" value="0x2"/>
        <value name="UART0_RTS" caption="UART0_RTS" value="0x3"/>
        <value name="UART1_RXD" caption="UART1_RXD" value="0x4"/>
        <value name="UART1_TXD" caption="UART1_TXD" value="0x5"/>
        <value name="UART1_CTS" caption="UART1_CTS" value="0x6"/>
        <value name="UART1_RTS" caption="UART1_RTS" value="0x7"/>
        <value name="I2C0_SDA" caption="I2C0_SDA" value="0x8"/>
        <value name="I2C0_SCL" caption="I2C0_SCL" value="0x9"/>
        <value name="I2C1_SDA" caption="I2C1_SDA" value="0xa"/>
        <value name="I2C1_SCL" caption="I2C1_SCL" value="0xb"/>
        <value name="PWM0_OUT" caption="PWM0_OUT" value="0xc"/>
        <value name="PWM1_OUT" caption="PWM1_OUT" value="0xd"/>
        <value name="PWM2_OUT" caption="PWM2_OUT" value="0xe"/>
        <value name="PWM3_OUT" caption="PWM3_OUT" value="0xf"/>
        <value name="32KHZ_CLK" caption="32KHZ_CLK" value="0x10"/>
        <value name="COEX_WLAN_TX" caption="COEX_WLAN_TX" value="0x11"/>
        <value name="COEX_WLAN_RX" caption="COEX_WLAN_RX" value="0x12"/>
        <value name="COEX_BLE_TX" caption="COEX_BLE_TX" value="0x13"/>
        <value name="COEX_BLE_RX" caption="COEX_BLE_RX" value="0x14"/>
        <value name="COEX_BLE_IN_PROCESS" caption="COEX_BLE_IN_PROCESS" value="0x15"/>
        <value name="COEX_BLE_MBSY" caption="COEX_BLE_MBSY" value="0x16"/>
        <value name="COEX_BLE_SYNC" caption="COEX_BLE_SYNC" value="0x17"/>
        <value name="COEX_BLE_RXNTX" caption="COEX_BLE_RXNTX" value="0x18"/>
        <value name="COEX_BLE_PTI_0" caption="COEX_BLE_PTI_0" value="0x19"/>
        <value name="COEX_BLE_PTI_1" caption="COEX_BLE_PTI_1" value="0x1a"/>
        <value name="COEX_BLE_PTI_2" caption="COEX_BLE_PTI_2" value="0x1b"/>
        <value name="COEX_BLE_PTI_3" caption="COEX_BLE_PTI_3" value="0x1c"/>
        <value name="QUAD_DEC0_A" caption="QUAD_DEC0_A" value="0x1d"/>
        <value name="QUAD_DEC0_B" caption="QUAD_DEC0_B" value="0x1e"/>
        <value name="QUAD_DEC1_A" caption="QUAD_DEC1_A" value="0x1f"/>
        <value name="QUAD_DEC1_B" caption="QUAD_DEC1_B" value="0x20"/>
        <value name="QUAD_DEC2_A" caption="QUAD_DEC2_A" value="0x21"/>
        <value name="QUAD_DEC2_B" caption="QUAD_DEC2_B" value="0x22"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_3_LP_GPIO_15">
        <value name="UART0_RXD" caption="UART0_RXD" value="0x0"/>
        <value name="UART0_TXD" caption="UART0_TXD" value="0x1"/>
        <value name="UART0_CTS" caption="UART0_CTS" value="0x2"/>
        <value name="UART0_RTS" caption="UART0_RTS" value="0x3"/>
        <value name="UART1_RXD" caption="UART1_RXD" value="0x4"/>
        <value name="UART1_TXD" caption="UART1_TXD" value="0x5"/>
        <value name="UART1_CTS" caption="UART1_CTS" value="0x6"/>
        <value name="UART1_RTS" caption="UART1_RTS" value="0x7"/>
        <value name="I2C0_SDA" caption="I2C0_SDA" value="0x8"/>
        <value name="I2C0_SCL" caption="I2C0_SCL" value="0x9"/>
        <value name="I2C1_SDA" caption="I2C1_SDA" value="0xa"/>
        <value name="I2C1_SCL" caption="I2C1_SCL" value="0xb"/>
        <value name="PWM0_OUT" caption="PWM0_OUT" value="0xc"/>
        <value name="PWM1_OUT" caption="PWM1_OUT" value="0xd"/>
        <value name="PWM2_OUT" caption="PWM2_OUT" value="0xe"/>
        <value name="PWM3_OUT" caption="PWM3_OUT" value="0xf"/>
        <value name="32KHZ_CLK" caption="32KHZ_CLK" value="0x10"/>
        <value name="COEX_WLAN_TX" caption="COEX_WLAN_TX" value="0x11"/>
        <value name="COEX_WLAN_RX" caption="COEX_WLAN_RX" value="0x12"/>
        <value name="COEX_BLE_TX" caption="COEX_BLE_TX" value="0x13"/>
        <value name="COEX_BLE_RX" caption="COEX_BLE_RX" value="0x14"/>
        <value name="COEX_BLE_IN_PROCESS" caption="COEX_BLE_IN_PROCESS" value="0x15"/>
        <value name="COEX_BLE_MBSY" caption="COEX_BLE_MBSY" value="0x16"/>
        <value name="COEX_BLE_SYNC" caption="COEX_BLE_SYNC" value="0x17"/>
        <value name="COEX_BLE_RXNTX" caption="COEX_BLE_RXNTX" value="0x18"/>
        <value name="COEX_BLE_PTI_0" caption="COEX_BLE_PTI_0" value="0x19"/>
        <value name="COEX_BLE_PTI_1" caption="COEX_BLE_PTI_1" value="0x1a"/>
        <value name="COEX_BLE_PTI_2" caption="COEX_BLE_PTI_2" value="0x1b"/>
        <value name="COEX_BLE_PTI_3" caption="COEX_BLE_PTI_3" value="0x1c"/>
        <value name="QUAD_DEC0_A" caption="QUAD_DEC0_A" value="0x1d"/>
        <value name="QUAD_DEC0_B" caption="QUAD_DEC0_B" value="0x1e"/>
        <value name="QUAD_DEC1_A" caption="QUAD_DEC1_A" value="0x1f"/>
        <value name="QUAD_DEC1_B" caption="QUAD_DEC1_B" value="0x20"/>
        <value name="QUAD_DEC2_A" caption="QUAD_DEC2_A" value="0x21"/>
        <value name="QUAD_DEC2_B" caption="QUAD_DEC2_B" value="0x22"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_4_LP_GPIO_16">
        <value name="UART0_RXD" caption="UART0_RXD" value="0x0"/>
        <value name="UART0_TXD" caption="UART0_TXD" value="0x1"/>
        <value name="UART0_CTS" caption="UART0_CTS" value="0x2"/>
        <value name="UART0_RTS" caption="UART0_RTS" value="0x3"/>
        <value name="UART1_RXD" caption="UART1_RXD" value="0x4"/>
        <value name="UART1_TXD" caption="UART1_TXD" value="0x5"/>
        <value name="UART1_CTS" caption="UART1_CTS" value="0x6"/>
        <value name="UART1_RTS" caption="UART1_RTS" value="0x7"/>
        <value name="I2C0_SDA" caption="I2C0_SDA" value="0x8"/>
        <value name="I2C0_SCL" caption="I2C0_SCL" value="0x9"/>
        <value name="I2C1_SDA" caption="I2C1_SDA" value="0xa"/>
        <value name="I2C1_SCL" caption="I2C1_SCL" value="0xb"/>
        <value name="PWM0_OUT" caption="PWM0_OUT" value="0xc"/>
        <value name="PWM1_OUT" caption="PWM1_OUT" value="0xd"/>
        <value name="PWM2_OUT" caption="PWM2_OUT" value="0xe"/>
        <value name="PWM3_OUT" caption="PWM3_OUT" value="0xf"/>
        <value name="32KHZ_CLK" caption="32KHZ_CLK" value="0x10"/>
        <value name="COEX_WLAN_TX" caption="COEX_WLAN_TX" value="0x11"/>
        <value name="COEX_WLAN_RX" caption="COEX_WLAN_RX" value="0x12"/>
        <value name="COEX_BLE_TX" caption="COEX_BLE_TX" value="0x13"/>
        <value name="COEX_BLE_RX" caption="COEX_BLE_RX" value="0x14"/>
        <value name="COEX_BLE_IN_PROCESS" caption="COEX_BLE_IN_PROCESS" value="0x15"/>
        <value name="COEX_BLE_MBSY" caption="COEX_BLE_MBSY" value="0x16"/>
        <value name="COEX_BLE_SYNC" caption="COEX_BLE_SYNC" value="0x17"/>
        <value name="COEX_BLE_RXNTX" caption="COEX_BLE_RXNTX" value="0x18"/>
        <value name="COEX_BLE_PTI_0" caption="COEX_BLE_PTI_0" value="0x19"/>
        <value name="COEX_BLE_PTI_1" caption="COEX_BLE_PTI_1" value="0x1a"/>
        <value name="COEX_BLE_PTI_2" caption="COEX_BLE_PTI_2" value="0x1b"/>
        <value name="COEX_BLE_PTI_3" caption="COEX_BLE_PTI_3" value="0x1c"/>
        <value name="QUAD_DEC0_A" caption="QUAD_DEC0_A" value="0x1d"/>
        <value name="QUAD_DEC0_B" caption="QUAD_DEC0_B" value="0x1e"/>
        <value name="QUAD_DEC1_A" caption="QUAD_DEC1_A" value="0x1f"/>
        <value name="QUAD_DEC1_B" caption="QUAD_DEC1_B" value="0x20"/>
        <value name="QUAD_DEC2_A" caption="QUAD_DEC2_A" value="0x21"/>
        <value name="QUAD_DEC2_B" caption="QUAD_DEC2_B" value="0x22"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_4_LP_GPIO_17">
        <value name="UART0_RXD" caption="UART0_RXD" value="0x0"/>
        <value name="UART0_TXD" caption="UART0_TXD" value="0x1"/>
        <value name="UART0_CTS" caption="UART0_CTS" value="0x2"/>
        <value name="UART0_RTS" caption="UART0_RTS" value="0x3"/>
        <value name="UART1_RXD" caption="UART1_RXD" value="0x4"/>
        <value name="UART1_TXD" caption="UART1_TXD" value="0x5"/>
        <value name="UART1_CTS" caption="UART1_CTS" value="0x6"/>
        <value name="UART1_RTS" caption="UART1_RTS" value="0x7"/>
        <value name="I2C0_SDA" caption="I2C0_SDA" value="0x8"/>
        <value name="I2C0_SCL" caption="I2C0_SCL" value="0x9"/>
        <value name="I2C1_SDA" caption="I2C1_SDA" value="0xa"/>
        <value name="I2C1_SCL" caption="I2C1_SCL" value="0xb"/>
        <value name="PWM0_OUT" caption="PWM0_OUT" value="0xc"/>
        <value name="PWM1_OUT" caption="PWM1_OUT" value="0xd"/>
        <value name="PWM2_OUT" caption="PWM2_OUT" value="0xe"/>
        <value name="PWM3_OUT" caption="PWM3_OUT" value="0xf"/>
        <value name="32KHZ_CLK" caption="32KHZ_CLK" value="0x10"/>
        <value name="COEX_WLAN_TX" caption="COEX_WLAN_TX" value="0x11"/>
        <value name="COEX_WLAN_RX" caption="COEX_WLAN_RX" value="0x12"/>
        <value name="COEX_BLE_TX" caption="COEX_BLE_TX" value="0x13"/>
        <value name="COEX_BLE_RX" caption="COEX_BLE_RX" value="0x14"/>
        <value name="COEX_BLE_IN_PROCESS" caption="COEX_BLE_IN_PROCESS" value="0x15"/>
        <value name="COEX_BLE_MBSY" caption="COEX_BLE_MBSY" value="0x16"/>
        <value name="COEX_BLE_SYNC" caption="COEX_BLE_SYNC" value="0x17"/>
        <value name="COEX_BLE_RXNTX" caption="COEX_BLE_RXNTX" value="0x18"/>
        <value name="COEX_BLE_PTI_0" caption="COEX_BLE_PTI_0" value="0x19"/>
        <value name="COEX_BLE_PTI_1" caption="COEX_BLE_PTI_1" value="0x1a"/>
        <value name="COEX_BLE_PTI_2" caption="COEX_BLE_PTI_2" value="0x1b"/>
        <value name="COEX_BLE_PTI_3" caption="COEX_BLE_PTI_3" value="0x1c"/>
        <value name="QUAD_DEC0_A" caption="QUAD_DEC0_A" value="0x1d"/>
        <value name="QUAD_DEC0_B" caption="QUAD_DEC0_B" value="0x1e"/>
        <value name="QUAD_DEC1_A" caption="QUAD_DEC1_A" value="0x1f"/>
        <value name="QUAD_DEC1_B" caption="QUAD_DEC1_B" value="0x20"/>
        <value name="QUAD_DEC2_A" caption="QUAD_DEC2_A" value="0x21"/>
        <value name="QUAD_DEC2_B" caption="QUAD_DEC2_B" value="0x22"/>
      </value-group>
