Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11ZR.atdf
        <register name="SINGLE_COUNT_DURATION" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Count for the single count AND reload">
          <bitfield name="SINGLE_COUNT_DURATION" mask="0xFFFFFFFF"/>
        </register>
        <register name="CURRENT_COUNT_VALUE" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Current count of the sleep timer">
          <bitfield name="CURRENT_COUNT_VALUE" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="AON_PWR_SEQ" id="AONPS1234" version="1.0.0" caption="Always On Power Sequencer">
      <register-group name="AON_PWR_SEQ" caption="Always On Power Sequencer">
        <register name="GPIO_WAKEUP_CTRL" offset="0x0" rw="RW" size="1" initval="0x2" caption="Controls the wakeup enable for GPIO_0, GPIO_1 and GPIO_2 (Pinmux will control the ARM wakeup)">
          <bitfield name="BLE_ENABLE" mask="0x2" caption="If set, this will enable GPIO_0 to wake up the BLE domain (PD4, PD5 and PD6)"/>
        </register>
        <register name="AON_ST_WAKEUP_CTRL" offset="0xC" rw="RW" size="1" initval="0x0" caption="Controls the wakeup enable for the Always On Sleep Timer (AON_ST)">
          <bitfield name="ARM_ENABLE" mask="0x1" caption="If set, this will enable the AON_ST to wake up the ARM domain (PD1, PD2 and PD3)"/>
          <bitfield name="BLE_ENABLE" mask="0x2" caption="If set, this will enable the AON_ST to wake up the BLE domain (PD4, PD5 and PD6)"/>
        </register>
        <register name="LPMCU_WAKEUP_CTRL" offset="0x10" rw="RW" size="2" initval="0x000" caption="Controls the wakeup enable for the Low Power Micro Controller Unit (LPMCU)">
          <bitfield name="BLE_ENABLE" mask="0x040" caption="If set, this will enable the LPMCU to wake up the BLE domain (PD4, PD5 and PD6)"/>
          <bitfield name="PD7_ENABLE" mask="0x200" caption="If set, this will enable the LPMCU to wakeup the PD7 domain (EFUSE)"/>
        </register>
        <register name="BLE_ST_WAKEUP_CTRL" offset="0x14" rw="RW" size="1" initval="0x0" caption="Controls the wakeup enable for the BLE Sleep Timer (BLE_ST)">
          <bitfield name="ARM_ENABLE" mask="0x1" caption="If set, this will enable the BLE_ST to wake up the ARM domain"/>
          <bitfield name="BLE_ENABLE" mask="0x2" caption="If set, this will enable the BLE_ST to wake up the BLE domain"/>
        </register>
        <register name="LPMCU_SLEEP_1_CTRL" offset="0x20" rw="RW" size="4" initval="0x000000" caption="Controls the sleep and retention options for SLEEP request 1 from the ARM">
          <bitfield name="ARM_SLEEP_EN" mask="0x000001" caption="Enables the SLEEP request 1 to put all ARM domains in sleep or retention (PD1, PD2A, PD2B, PD3, PD8).  PD7 has its own control"/>
          <bitfield name="BLE_SLEEP_EN" mask="0x000040" caption="Enables the SLEEP request 1 to put PD4 domain in sleep (BLE Core) and PD5 (BLE memories) in sleep or retention"/>
          <bitfield name="PD6_SLEEP_EN" mask="0x000100" caption="Enables the SLEEP request 1 to put PD6 domain in sleep (BLE Sleep Timer)"/>
          <bitfield name="PD7_SLEEP_EN" mask="0x000200" caption="Enables the SLEEP request 1 to put PD7 domain in sleep (EFUSE)"/>
          <bitfield name="PD2A_RETENTION_EN" mask="0x010000" caption="If 1, then PD2A will be put in retention mode when instructed to go to sleep (First ARM Memory 16K)"/>
          <bitfield name="PD2B_RETENTION_EN" mask="0x020000" caption="If 1, then PD2B will be put in retention mode when instructed to go to sleep (Second ARM Memory 16K)"/>
          <bitfield name="PD3_RETENTION_EN" mask="0x040000" caption="If 1, then PD3 will be put in retention mode when instructed to go to sleep (Third, Fourth and Fifth ARM Memories 3x32K = 96K)"/>
          <bitfield name="PD5_RETENTION_EN" mask="0x200000" caption="If 1, then PD5 will be put in retention mode when instructed to go to sleep (BLE Retention Memory)"/>
          <bitfield name="PD8_RETENTION_EN" mask="0x400000" caption="If 1, then PD8 will be put in retention mode when instructed to go to sleep (BLE LP Memory)"/>
        </register>
        <register name="OFF_DELAY_0_CTRL" offset="0x40" rw="RW" size="4" initval="0x04030001" caption="Power OFF Delays">
          <bitfield name="CLOCK_EN_EARLY" mask="0x0000003F" caption="Number of clock cycles before setting clock_en_early to low (clock_en is +1 of this value)"/>
          <bitfield name="ISOLATE" mask="0x003F0000" caption="Number of clock cycles before enabling the isolation cells"/>
          <bitfield name="RESETN" mask="0x3F000000" caption="Number of clock cycles before asserting RESETN"/>
        </register>
        <register name="OFF_DELAY_1_CTRL" offset="0x44" rw="RW" size="4" initval="0x08070605" caption="Power OFF Delays">
          <bitfield name="BTRIM" mask="0x0000003F" caption="Number of clock cycles before applying BTRIM mux select"/>
          <bitfield name="STDBY_N" mask="0x00003F00" caption="Number of clock cycles before applying STDBY_N"/>
          <bitfield name="POWER_VDD" mask="0x003F0000" caption="Number of clock cycles before cutting off power (VDD and standard cells)"/>
          <bitfield name="POWER_VDM" mask="0x3F000000" caption="Number of clock cycles before cutting off or lowering power (VDM)"/>
        </register>
        <register name="ON_DELAY_0_CTRL" offset="0x48" rw="RW" size="2" initval="0x2727" caption="Power ON Delays">
          <bitfield name="CLOCK_EN_EARLY_ARM" mask="0x003F" caption="Number of clock cycles before setting clock_en_early to high for ARM domain clock_en is +1 of this value isolate is -2 of this value resetn is -1 of this value "/>
          <bitfield name="CLOCK_EN_EARLY_BLE" mask="0x3F00" caption="Number of clock cycles before setting clock_en_early to high for BLE domain clock_en is +1 of this value isolate is -2 of this value resetn is -1 of this value "/>
        </register>
        <register name="ON_DELAY_1_CTRL" offset="0x4C" rw="RW" size="4" initval="0x01020304" caption="Power ON Delays">
          <bitfield name="BTRIM" mask="0x0000003F" caption="Number of clock cycles before removing BTRIM mux select"/>
          <bitfield name="STDBY_N" mask="0x00003F00" caption="Number of clock cycles before de-asserting the STDBY_N"/>
          <bitfield name="POWER_VDD" mask="0x003F0000" caption="Number of clock cycles before applying VDD power"/>
          <bitfield name="POWER_VDM" mask="0x3F000000" caption="Number of clock cycles before applying VDM power"/>
        </register>
        <register name="VDD_DCDC_EN_DELAY_CTRL" offset="0x50" rw="RW" size="2" initval="0x2106" caption="VDD_DCDC_EN Delay Control">
          <bitfield name="OFF" mask="0x003F" caption="Number of clock cycles before disabling the DCDC"/>
          <bitfield name="ON" mask="0x3F00" caption="Number of clock cycles before turning on the DCDC"/>
        </register>
        <register name="MISC_BYPASS_0_CTRL" offset="0x218" rw="RW" size="2" initval="0x088" caption="Bypass control for misc signals">
          <bitfield name="PD0_LOW_VOLTAGE_EN_VAL" mask="0x004" caption="Bypass value for pd0_low_voltage_en"/>
          <bitfield name="PD0_LOW_VOLTAGE_EN_EN" mask="0x008" caption="Bypass enable for pd0_low_voltage_en"/>
          <bitfield name="ENABLE_CLOCK_GATE" mask="0x010" caption="If set, allows the AON PS to gate its own clock while waiting for an event to enable it again"/>
          <bitfield name="VDD_DCDC_EN_VAL" mask="0x040" caption="Bypass value for vdd_dcdc_en"/>
          <bitfield name="VDD_DCDC_EN_EN" mask="0x080" caption="Bypass enable for vdd_dcdc_en"/>
          <bitfield name="FORCE_ON_BLE_CORE" mask="0x100" caption="If set, this will keep the power enabled for the BLE Core (enables the DCDC operation)"/>
          <bitfield name="FORCE_ON_BLE_MEMORIES" mask="0x200" caption="If set, this will keep the power enabled for the BLE memories (enables the DCDC operation)"/>
        </register>
        <register name="RAW_WAKEUP_BITS" offset="0x300" rw="R" size="1" initval="0x00" caption="Raw Wakeup Bits">
          <bitfield name="GPIO_0" mask="0x01" caption="AO_GPIO_0 wakeup raw status"/>
          <bitfield name="GPIO_1" mask="0x02" caption="AO_GPIO_1 wakeup raw status"/>
          <bitfield name="GPIO_2" mask="0x04" caption="AO_GPIO_2 wakeup raw status"/>
          <bitfield name="AON_ST" mask="0x08" caption="AON_ST wakeup raw status"/>
          <bitfield name="LPMCU" mask="0x10" caption="LPMCU wakeup raw status"/>
          <bitfield name="BLE_ST" mask="0x20" caption="BLE_ST wakeup raw status"/>
        </register>
        <register name="PD_WAKEUP_BITS" offset="0x304" rw="R" size="2" initval="0x000" caption="Individual Power Domain Wakeup Bits">
          <bitfield name="ARM" mask="0x001" caption="Indicates ARM (PD1, PD2A, PD2B, PD3, PD8) currently has a wakeup active"/>
          <bitfield name="BLE" mask="0x040" caption="Indicates BLE (PD4 and PD5) currently has a wakeup active"/>
          <bitfield name="PD6" mask="0x100" caption="Indicates PD6 currently has a wakeup active"/>
          <bitfield name="PD7" mask="0x200" caption="Indicates PD7 currently has a wakeup active"/>
        </register>
