Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11ZR.atdf
        <register name="SERVICED_REQUEST" offset="0x308" rw="R" size="2" initval="0x000" caption="Serviced Request Status Bits">
          <bitfield name="GPIO_WAKEUP" mask="0x001" caption="Indicates GPIO wakeup has been serviced"/>
          <bitfield name="AON_ST_WAKEUP" mask="0x008" caption="Indicates AON_ST wakeup has been serviced"/>
          <bitfield name="LPMCU_WAKEUP" mask="0x010" caption="Indicates LPMCU wakeup has been serviced"/>
          <bitfield name="BLE_ST_WAKEUP" mask="0x020" caption="Indicates BLE_ST wakeup has been serviced"/>
          <bitfield name="SLEEP_1" mask="0x100" caption="Indicates SLEEP 1 has been serviced"/>
        </register>
        <register name="ACTIVE_REQUEST" offset="0x30C" rw="R" size="2" initval="0x000" caption="Active Request Status Bits">
          <bitfield name="GPIO_WAKEUP" mask="0x001" caption="Indicates GPIO wakeup is the active request"/>
          <bitfield name="AON_ST_WAKEUP" mask="0x008" caption="Indicates AON_ST wakeup is the active request"/>
          <bitfield name="LPMCU_WAKEUP" mask="0x010" caption="Indicates LPMCU wakeup is the active request"/>
          <bitfield name="BLE_ST_WAKEUP" mask="0x020" caption="Indicates BLE_ST wakeup is the active request"/>
          <bitfield name="SLEEP_1" mask="0x100" caption="Indicates SLEEP 1 is the active request"/>
        </register>
        <register name="LOGIC_FSM_STATES" offset="0x3F0" rw="R" size="4" initval="0x00000" caption="Current Logic FSM States">
          <bitfield name="MAIN_FSM_STATE" mask="0x00007" values="AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE" caption="Main FSM State"/>
          <bitfield name="BLE_ON_STATE" mask="0x00100" caption="If 1, then PD4 and PD5 are ON"/>
          <bitfield name="BLE_OFF_STATE" mask="0x00200" caption="If 1, then PD4 and PD5 are OFF (PD5 is in RET if set by ARM)"/>
          <bitfield name="PD6_ON_STATE" mask="0x01000" caption="If 1, then PD6 is ON"/>
          <bitfield name="PD6_OFF_STATE" mask="0x02000" caption="If 1, then PD6 is OFF"/>
          <bitfield name="PD7_ON_STATE" mask="0x10000" caption="If 1, then PD7 is ON"/>
          <bitfield name="PD7_OFF_STATE" mask="0x20000" caption="If 1, then PD7 is OFF"/>
        </register>
      </register-group>
      <value-group name="AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE">
        <value name="0" caption="RESET" value="0x0"/>
        <value name="1" caption="READY" value="0x1"/>
        <value name="2" caption="TRANS" value="0x2"/>
        <value name="3" caption="RESET_TO_READY" value="0x3"/>
        <value name="4" caption="READY_TO_TRANS" value="0x4"/>
        <value name="5" caption="TRANS_TO_READY" value="0x5"/>
      </value-group>
    </module>
    <module name="AON_GP_REGS" id="AGR1234" version="1.0.0" caption="Always On General Purpose Registers">
      <register-group name="AON_GP_REGS" caption="Always On General Purpose Registers">
        <register name="AON_PINMUX_SEL" offset="0x0" rw="RW" size="2" initval="0x001" caption="Controls the pinmux selection for the AO GPIOs">
          <bitfield name="AO_GPIO_0_SEL" mask="0x003" caption="Pinmux select for AO_GPIO_0"/>
          <bitfield name="AO_GPIO_1_SEL" mask="0x030" caption="Pinmux select for AO_GPIO_1"/>
          <bitfield name="AO_GPIO_2_SEL" mask="0x300" caption="Pinmux select for AO_GPIO_2"/>
        </register>
        <register name="AON_PMU_CTRL" offset="0x4" rw="RW" size="4" initval="0x0A0022" caption="Always On Misc Control">
          <bitfield name="PMU_REGS_4TO1_SEL" mask="0x000001" caption="If 1 then uses the frequency hopping table otherwise registers in PD0"/>
          <bitfield name="PMU_RTC_CLK_EN" mask="0x000002" caption="Enables the PMU RTC clock"/>
          <bitfield name="PMU_RETN_VAL_SEL" mask="0x000030" caption="Retention Voltage Selection"/>
          <bitfield name="EFUSE_LDO_EN" mask="0x000080" caption="Enables the EFUSE LDO"/>
          <bitfield name="PMU_MUX_EN" mask="0x000100" caption="PMU MUX EN"/>
          <bitfield name="PMU_MUX_A" mask="0x000E00" caption="PMU MUX A"/>
          <bitfield name="PMU_MUX_SEL" mask="0x00F000" caption="PMU MUX SEL"/>
          <bitfield name="PMU_SENS_ADC_EN" mask="0x010000" caption="PMU Sensor ADC Enable"/>
          <bitfield name="PMU_SENS_ADC_RST" mask="0x020000" caption="PMU Sensor ADC Reset"/>
          <bitfield name="PMU_BGR_EN" mask="0x040000" caption="PMU BGR EN"/>
          <bitfield name="PMU_2MHZ_CLK_EN" mask="0x080000" caption="Enables the 2MHz OSC clock coming to the digital from the PMU"/>
          <bitfield name="PMU_26MHZ_CLK_FORCE_OFF" mask="0x100000" caption="If set, this will force off the OSC 26 MHz clock, otherwise this will follow the power for PD1"/>
        </register>
        <register name="AON_BLE_LP_CTRL" offset="0x8" rw="RW" size="1" initval="0x0" caption="Always On BLE LP Control">
          <bitfield name="WAKEUP_LP_LATCH" mask="0x1" caption="If set, this will latch the wakeup signal in the BLE LP block"/>
          <bitfield name="DEEP_SLEEP_STAT_SYNC_EN" mask="0x2" caption="If set, this will use the sync flops for deep sleep stat"/>
        </register>
        <register name="AON_MISC_CTRL" offset="0xC" rw="RW" size="4" initval="0x010000" caption="Always On Misc Control">
          <bitfield name="USE_RTC_32KHZ_CLK_SLEEP_TIMER" mask="0x000002" caption="If set, this will use the RTC version of the 32khz clock for the sleep timer"/>
          <bitfield name="USE_EXT_32KHZ_CLK_SLEEP_TIMER" mask="0x000004" caption="If set, this will use an external RTC for the 32khz clock for the sleep timer"/>
          <bitfield name="LPMCU_BOOT_RESET_MUXSEL" mask="0x000008" caption="If 1, then it uses the CPU register bit, otherwise LP_BOOT_PIN is connected"/>
          <bitfield name="LPMCU_USE_BOOT_REGS" mask="0x000010" caption="If 1, then the ARM will use the boot regs instead of the boot rom for the first 4 boot addresses (0x0 - 0xF)"/>
          <bitfield name="LPMCU_CPU_RESET_OVERRIDE_EN" mask="0x000020" caption="If 1, then it will use the PD0 register value for LPMCU CPU RESET (higher priority than lpmcu_boot_reset_muxsel)"/>
          <bitfield name="LPMCU_CPU_RESET_OVERRIDE_VAL" mask="0x000040" caption="If lpmcu_cpu_reset_override_en is set then this value will be used for the LPMCU CPU RESET"/>
          <bitfield name="USE_2M_AON_PWR_SEQ_CLK" mask="0x004000" caption="If set, this will use either the osc 2M or rtc 32kHz clock for the AON power sequencer.  The field use_rtc_aon_pwr_seq_clk determines which."/>
          <bitfield name="USE_OSC2M_AS_TB_CLK" mask="0x008000" caption="If set, this will use the osc 2M clock as the PD0 testbus clock"/>
          <bitfield name="AON_SLEEP_TIMER_CLK_EN" mask="0x010000" caption="If set, this will enable the 32khz clock to the AON Sleep Timer"/>
          <bitfield name="AON_EXT_32KHZ_OUT_EN" mask="0x020000" caption="If set, this will enable the 32khz clock to the AON pads as an output of the chip"/>
          <bitfield name="USE_RTC_AON_PWR_SEQ_CLK" mask="0x040000" caption="If set, this will use the RTC clock as the AON power sequencer clock once use_2m_aon_pwr_seq_clk is also set.  This must be set first."/>
          <bitfield name="INVERT_WAKEUP_GPIO_0" mask="0x080000" caption="If set, this will invert the wakeup gpio_0"/>
          <bitfield name="FORCE_OFF_XO" mask="0x100000" caption="If set, this will force off the XO, otherwise XO is always on if BLE core is powered on."/>
          <bitfield name="FORCE_XO_TO_BYPASS_MODE" mask="0x200000" caption="If set, this will force the XO into bypass mode."/>
        </register>
