Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11ZR.atdf
        <register name="MS_GPIO_MODE" offset="0x410" rw="RW" size="1" initval="0xF" caption="Analog Mode Select of Mixed Signal GPIOs">
          <bitfield name="ANALOG_ENABLE_44" mask="0x1" caption="Active High Analog Mode Enable for Mixed Signal LP_GPIO_44"/>
          <bitfield name="ANALOG_ENABLE_45" mask="0x2" caption="Active High Analog Mode Enable for Mixed Signal LP_GPIO_45"/>
          <bitfield name="ANALOG_ENABLE_46" mask="0x4" caption="Active High Analog Mode Enable for Mixed Signal LP_GPIO_46"/>
          <bitfield name="ANALOG_ENABLE_47" mask="0x8" caption="Active High Analog Mode Enable for Mixed Signal LP_GPIO_47"/>
        </register>
        <register name="IO_PADS_CONTROL" offset="0x414" rw="RW" size="1" initval="0x1" caption="Controls behaviour of IO Pads in Sleep Mode">
          <bitfield name="LATCH_ENABLE" mask="0x1" caption="Active High Latch Enable of IO Pads configuration parameters. When Low, Pads retain their configured state during sleep mode."/>
        </register>
      </register-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_0_CLK_EDGE_SEL">
        <value name="0" caption="Comparator samples on rising edge of clock" value="0x0"/>
        <value name="1" caption="Comparator samples on falling edge of clock" value="0x1"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK">
        <value name="0" caption="1.12V" value="0x0"/>
        <value name="1" caption="1.15V" value="0x1"/>
        <value name="2" caption="1.17V" value="0x2"/>
        <value name="3" caption="1.20V" value="0x3"/>
        <value name="4" caption="1.22V" value="0x4"/>
        <value name="5" caption="1.25V" value="0x5"/>
        <value name="6" caption="1.27V" value="0x6"/>
        <value name="7" caption="1.30V" value="0x7"/>
        <value name="8" caption="1.32V" value="0x8"/>
        <value name="9" caption="1.35V" value="0x9"/>
        <value name="10" caption="1.37V" value="0xa"/>
        <value name="11" caption="1.40V" value="0xb"/>
        <value name="12" caption="1.42V" value="0xc"/>
        <value name="13" caption="1.45V" value="0xd"/>
        <value name="14" caption="1.47V" value="0xe"/>
        <value name="15" caption="1.50V" value="0xf"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_0_CLK_2_4">
        <value name="0" caption="Divide by 2" value="0x0"/>
        <value name="1" caption="Divide by 4" value="0x1"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV">
        <value name="0" caption="Divide by 4" value="0x0"/>
        <value name="1" caption="Divide by 6" value="0x1"/>
        <value name="2" caption="Divide by 8" value="0x2"/>
        <value name="3" caption="Divide by 10" value="0x3"/>
        <value name="4" caption="Divide by 12" value="0x4"/>
        <value name="5" caption="Divide by 14" value="0x5"/>
        <value name="6" caption="Divide by 16" value="0x6"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_0_RESET_FSM">
        <value name="0" caption="FSM is not reset" value="0x0"/>
        <value name="1" caption="FSM is reset" value="0x1"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_0_EN_TRISTATE">
        <value name="0" caption="Tristate logic disable" value="0x0"/>
        <value name="1" caption="Tristate logic enabled" value="0x1"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL">
        <value name="0" caption="Divide by 4" value="0x0"/>
        <value name="1" caption="Divide by 6" value="0x1"/>
        <value name="2" caption="Divide by 8" value="0x2"/>
        <value name="3" caption="Divide by 10" value="0x3"/>
        <value name="4" caption="Divide by 12" value="0x4"/>
        <value name="5" caption="Divide by 14" value="0x5"/>
        <value name="6" caption="Divide by 16" value="0x6"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL">
        <value name="0" caption="0.0mV offset" value="0x0"/>
        <value name="1" caption="0.4mV offset" value="0x1"/>
        <value name="2" caption="0.8mV offset" value="0x2"/>
        <value name="3" caption="1.2mV offset" value="0x3"/>
        <value name="4" caption="1.6mV offset" value="0x4"/>
        <value name="5" caption="2.0mV offset" value="0x5"/>
        <value name="6" caption="2.4mV offset" value="0x6"/>
        <value name="7" caption="2.8mV offset" value="0x7"/>
        <value name="8" caption="3.2mV offset" value="0x8"/>
        <value name="9" caption="3.6mV offset" value="0x9"/>
        <value name="10" caption="4.0mV offset" value="0xa"/>
        <value name="11" caption="4.4mV offset" value="0xb"/>
        <value name="12" caption="4.8mV offset" value="0xc"/>
        <value name="13" caption="5.2mV offset" value="0xd"/>
        <value name="14" caption="5.6mV offset" value="0xe"/>
        <value name="15" caption="6.0mV offset" value="0xf"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL">
        <value name="0" caption="0.0mV offset" value="0x0"/>
        <value name="1" caption="0.4mV offset" value="0x1"/>
        <value name="2" caption="0.8mV offset" value="0x2"/>
        <value name="3" caption="1.2mV offset" value="0x3"/>
        <value name="4" caption="1.6mV offset" value="0x4"/>
        <value name="5" caption="2.0mV offset" value="0x5"/>
        <value name="6" caption="2.4mV offset" value="0x6"/>
        <value name="7" caption="2.8mV offset" value="0x7"/>
        <value name="8" caption="3.2mV offset" value="0x8"/>
        <value name="9" caption="3.6mV offset" value="0x9"/>
        <value name="10" caption="4.0mV offset" value="0xa"/>
        <value name="11" caption="4.4mV offset" value="0xb"/>
        <value name="12" caption="4.8mV offset" value="0xc"/>
        <value name="13" caption="5.2mV offset" value="0xd"/>
        <value name="14" caption="5.6mV offset" value="0xe"/>
        <value name="15" caption="6.0mV offset" value="0xf"/>
      </value-group>
