Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11ZR.atdf
      <value-group name="SPI_FLASH_STATUS_FIFO_CTRL_STATE">
        <value name="0" caption="FLASH_IDLE" value="0x0"/>
        <value name="1" caption="GET_DATA_FROM_FLASH" value="0x1"/>
        <value name="2" caption="WRITE_DATA_TO_AHB" value="0x2"/>
        <value name="3" caption="GET_DATA_FROM_AHB" value="0x3"/>
        <value name="4" caption="WRITE_DATA_TO_FLASH" value="0x4"/>
      </value-group>
      <value-group name="SPI_FLASH_STATUS_SPI_MASTER_STATE">
        <value name="0" caption="IDLE" value="0x0"/>
        <value name="1" caption="READ" value="0x1"/>
        <value name="2" caption="WRITE" value="0x2"/>
        <value name="3" caption="READ_FLASH" value="0x3"/>
        <value name="4" caption="WRITE_FLASH" value="0x4"/>
        <value name="5" caption="PRE_ACTION" value="0x5"/>
        <value name="6" caption="POST_ACTION" value="0x6"/>
        <value name="7" caption="WAIT_AHB" value="0x7"/>
      </value-group>
    </module>
    <module name="ARM_SYSCTRL" id="ASC1234" version="1.0.0" caption="ARM System Control">
      <register-group name="ARM_SYSCTRL" caption="ARM System Control">
        <register name="ACTLR" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Auxiliary Control Register (not implemented)">
          <bitfield name="ACTLR" mask="0xFFFFFFFF"/>
        </register>
        <register name="SYST_CSR" offset="0x10" rw="RW" size="4" initval="0x00004" caption="SysTick Control and Status Register">
          <bitfield name="ENABLE" mask="0x00001" values="ARM_SYSCTRL_SYST_CSR_ENABLE" caption="Indicates the enabled status of the SysTick counter"/>
          <bitfield name="TICKINT" mask="0x00002" values="ARM_SYSCTRL_SYST_CSR_TICKINT" caption="Indicates whether counting to 0 causes the status of the SysTick exception to change to pending"/>
          <bitfield name="CLKSOURCE" mask="0x00004" caption="SysTick uses the processor clock (writes are ignored)"/>
          <bitfield name="COUNTFLAG" mask="0x10000" caption="If 1 then the timer has counted to 0"/>
        </register>
        <register name="SYST_RVR" offset="0x14" rw="RW" size="4" initval="0x000000" caption="SysTick Reload Value Register">
          <bitfield name="SYST_RVR" mask="0xFFFFFF"/>
        </register>
        <register name="SYST_CVR" offset="0x18" rw="RW" size="4" initval="0x000000" caption="SysTick Current Value Register (Any Write Clears to 0)">
          <bitfield name="SYST_CVR" mask="0xFFFFFF"/>
        </register>
        <register name="SYST_CALIB" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="SysTick Calibration Value Register">
          <bitfield name="TENMS" mask="0x00FFFFFF" caption="Holds a reload value to be used for 10ms timing. If 0 then calibration value is not known."/>
          <bitfield name="SKEW" mask="0x40000000" caption="If 1 then 10ms calibration value is inexact"/>
          <bitfield name="NOREF" mask="0x80000000" caption="If 1 then reference clock is not implemented"/>
        </register>
        <register name="NVIC_ISER" offset="0x100" rw="RW" size="4" initval="0x00000000" caption="Interrupt Set-Enable Register">
          <bitfield name="SETENA" mask="0xFFFFFFFF" caption="Write 1 to enable the associated interrupt"/>
        </register>
        <register name="NVIC_ICER" offset="0x180" rw="RW" size="4" initval="0x00000000" caption="Interrupt Clear Enable Register">
          <bitfield name="CLRENA" mask="0xFFFFFFFF" caption="Write 1 to disable the associated interrupt"/>
        </register>
        <register name="NVIC_ISPR" offset="0x200" rw="RW" size="4" initval="0x00000000" caption="Interrupt Set-Pending Register">
          <bitfield name="SETPEND" mask="0xFFFFFFFF" caption="Change the state of the associated interrupt to pending"/>
        </register>
        <register name="NVIC_ICPR" offset="0x280" rw="RW" size="4" initval="0x00000000" caption="Interrupt Clear-Pending Register">
          <bitfield name="CLRPEND" mask="0xFFFFFFFF" caption="Change the state of the associated interrupt to not pending"/>
        </register>
        <register name="NVIC_IPR0" offset="0x400" rw="RW" size="4" initval="0x00000000" caption="Interrupt Priority Register 0">
          <bitfield name="PRI_N0" mask="0x000000C0" caption="Priority of Interrupt 0"/>
          <bitfield name="PRI_N1" mask="0x0000C000" caption="Priority of Interrupt 1"/>
          <bitfield name="PRI_N2" mask="0x00C00000" caption="Priority of Interrupt 2"/>
          <bitfield name="PRI_N3" mask="0xC0000000" caption="Priority of Interrupt 3"/>
        </register>
        <register name="NVIC_IPR1" offset="0x404" rw="RW" size="4" initval="0x00000000" caption="Interrupt Priority Register 1">
          <bitfield name="PRI_N4" mask="0x000000C0" caption="Priority of Interrupt 4"/>
          <bitfield name="PRI_N5" mask="0x0000C000" caption="Priority of Interrupt 5"/>
          <bitfield name="PRI_N6" mask="0x00C00000" caption="Priority of Interrupt 6"/>
          <bitfield name="PRI_N7" mask="0xC0000000" caption="Priority of Interrupt 7"/>
        </register>
        <register name="NVIC_IPR2" offset="0x408" rw="RW" size="4" initval="0x00000000" caption="Interrupt Priority Register 2">
          <bitfield name="PRI_N8" mask="0x000000C0" caption="Priority of Interrupt 8"/>
          <bitfield name="PRI_N9" mask="0x0000C000" caption="Priority of Interrupt 9"/>
          <bitfield name="PRI_N10" mask="0x00C00000" caption="Priority of Interrupt 10"/>
          <bitfield name="PRI_N11" mask="0xC0000000" caption="Priority of Interrupt 11"/>
        </register>
        <register name="NVIC_IPR3" offset="0x40C" rw="RW" size="4" initval="0x00000000" caption="Interrupt Priority Register 3">
          <bitfield name="PRI_N12" mask="0x000000C0" caption="Priority of Interrupt 12"/>
          <bitfield name="PRI_N13" mask="0x0000C000" caption="Priority of Interrupt 13"/>
          <bitfield name="PRI_N14" mask="0x00C00000" caption="Priority of Interrupt 14"/>
          <bitfield name="PRI_N15" mask="0xC0000000" caption="Priority of Interrupt 15"/>
        </register>
