Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11ZR.atdf
        <register name="NVIC_IPR4" offset="0x410" rw="RW" size="4" initval="0x00000000" caption="Interrupt Priority Register 4">
          <bitfield name="PRI_N16" mask="0x000000E0" caption="Priority of Interrupt 16"/>
          <bitfield name="PRI_N17" mask="0x0000C000" caption="Priority of Interrupt 17"/>
          <bitfield name="PRI_N18" mask="0x00C00000" caption="Priority of Interrupt 18"/>
          <bitfield name="PRI_N19" mask="0xC0000000" caption="Priority of Interrupt 19"/>
        </register>
        <register name="NVIC_IPR5" offset="0x414" rw="RW" size="4" initval="0x00000000" caption="Interrupt Priority Register 5">
          <bitfield name="PRI_N20" mask="0x000000E0" caption="Priority of Interrupt 20"/>
          <bitfield name="PRI_N21" mask="0x0000C000" caption="Priority of Interrupt 21"/>
          <bitfield name="PRI_N22" mask="0x00C00000" caption="Priority of Interrupt 22"/>
          <bitfield name="PRI_N23" mask="0xC0000000" caption="Priority of Interrupt 23"/>
        </register>
        <register name="NVIC_IPR6" offset="0x418" rw="RW" size="4" initval="0x00000000" caption="Interrupt Priority Register 6">
          <bitfield name="PRI_N24" mask="0x000000E0" caption="Priority of Interrupt 24"/>
          <bitfield name="PRI_N25" mask="0x0000C000" caption="Priority of Interrupt 25"/>
          <bitfield name="PRI_N26" mask="0x00C00000" caption="Priority of Interrupt 26"/>
          <bitfield name="PRI_N27" mask="0xC0000000" caption="Priority of Interrupt 27"/>
        </register>
        <register name="NVIC_IPR7" offset="0x41C" rw="RW" size="4" initval="0x00000000" caption="Interrupt Priority Register 7">
          <bitfield name="PRI_N28" mask="0x000000E0" caption="Priority of Interrupt 28"/>
          <bitfield name="PRI_N29" mask="0x0000C000" caption="Priority of Interrupt 29"/>
          <bitfield name="PRI_N30" mask="0x00C00000" caption="Priority of Interrupt 30"/>
          <bitfield name="PRI_N31" mask="0xC0000000" caption="Priority of Interrupt 31"/>
        </register>
        <register name="CPUID" offset="0xD00" rw="R" size="4" initval="0x410CC200" caption="CPU Identification Register">
          <bitfield name="CPUID" mask="0xFFFFFFFF"/>
        </register>
        <register name="ICSR" offset="0xD04" rw="R" size="4" initval="0x00000000" caption="Interrupt Control State Register">
          <bitfield name="VECTACTIVE" mask="0x000001FF" caption="Exception number for the current executing exception"/>
          <bitfield name="VECTPENDING" mask="0x001FF000" caption="Exception number for highest priority pending exception"/>
          <bitfield name="ISRPENDING" mask="0x00400000" caption="If 1, Interrupt is pending"/>
          <bitfield name="ISRPREEMPT" mask="0x00800000" caption="If 1, will service a pending exception"/>
          <bitfield name="PENDSTCLR" mask="0x02000000" caption="Clear Pending SysTick"/>
          <bitfield name="PENDSTSET" mask="0x04000000" caption="Set pending SysTick"/>
          <bitfield name="PENDSVCLR" mask="0x08000000" caption="Clearing pending PendSV"/>
          <bitfield name="PENDSVSET" mask="0x10000000" caption="Set pending PendSV interrupt"/>
          <bitfield name="NMIPENDSET" mask="0x80000000" caption="Activate NMI Exception"/>
        </register>
        <register name="AIRCR" offset="0xD0C" rw="R" size="4" initval="0x00000000" caption="Application Interrupt and Reset Control Register">
          <bitfield name="VECTCLRACTIVE" mask="0x00000002" caption="Clears all active state information for fixed and configurable exceptions"/>
          <bitfield name="SYSRESETREQ" mask="0x00000004" caption="Active High System Reset Request"/>
          <bitfield name="ENDIANNESS" mask="0x00008000" caption="If 1 then big endian"/>
          <bitfield name="VECTKEY" mask="0xFFFF0000" caption="Vector Key, must write 0x05FA to this otherwise the write is UNPREDICTABLE"/>
        </register>
        <register name="SCR" offset="0xD10" rw="RW" size="1" initval="0x00" caption="System Control Register">
          <bitfield name="SLEEPONEXIT" mask="0x02" caption="Enter sleep state on exit from an ISR"/>
          <bitfield name="SLEEPDEEP" mask="0x04" caption="Selected sleep state is deep sleep"/>
          <bitfield name="SEVONPEND" mask="0x10" caption="Transitions from inactive to pending are wakeup events"/>
        </register>
        <register name="CCR" offset="0xD14" rw="R" size="2" initval="0x000" caption="Configuration and Control Register">
          <bitfield name="UNALIGN_TRP" mask="0x008" caption="Unaligned work and halfword accesses generate a HardFault exception"/>
          <bitfield name="STKALIGN" mask="0x200" caption="On exception entry, SP used prior to exception is adjusted to be 8-byte aligned and context to restore it is saved"/>
        </register>
        <register name="SHPR2" offset="0xD1C" rw="RW" size="4" initval="0x00000000" caption="System Handler Priority Register 2">
          <bitfield name="PRI_11" mask="0xC0000000" caption="Priority of system handler 11, SVCall"/>
        </register>
        <register name="SHPR3" offset="0xD20" rw="RW" size="4" initval="0x00000000" caption="System Handler Priority Register 3">
          <bitfield name="PRI_14" mask="0x00C00000" caption="Priority of system handler 14, PendSV"/>
          <bitfield name="PRI_15" mask="0xC0000000" caption="Priority of system handler 15, SysTick"/>
        </register>
        <register name="SHCSR" offset="0xD24" rw="RW" size="2" initval="0x0000" caption="System Handler Control and State Register">
          <bitfield name="SVCALLPENDED" mask="0x8000" caption="SVCall is pending"/>
        </register>
        <register name="DFSR" offset="0xD30" rw="RW" size="1" initval="0x00" caption="Debug Fault Status Register">
          <bitfield name="HALTED" mask="0x01" caption="Halt Request Debug Event Active"/>
          <bitfield name="BKPT" mask="0x02" caption="At least one breakpoint debug event"/>
          <bitfield name="DWTTRAP" mask="0x04" caption="At least one debug event generated by DWT"/>
          <bitfield name="VCATCH" mask="0x08" caption="Vector catch debug event generated"/>
          <bitfield name="EXTERNAL" mask="0x10" caption="EDBGRQ debug event"/>
        </register>
        <register name="DHCSR" offset="0xDF0" rw="RW" size="4" initval="0x0000000" caption="Debug Halting Control and Status Register">
          <bitfield name="C_DEBUGEN" mask="0x0000001" caption="Halting Debug Enabled (Must write 0xA05F to bits 31:16 to access)"/>
          <bitfield name="C_HALT" mask="0x0000002" caption="Request a running processor to halt (Must write 0xA05F to bits 31:16 to access)"/>
          <bitfield name="C_STEP" mask="0x0000004" caption="Single-Stepping Enabled (Must write 0xA05F to bits 31:16 to access)"/>
          <bitfield name="C_MASKINTS" mask="0x0000008" caption="Mask PendSV, SysTick and external configurable interrupts (Must write 0xA05F to bits 31:16 to access)"/>
          <bitfield name="S_REGRDY" mask="0x0010000" caption="Transfer to or from the DCRDR is complete"/>
          <bitfield name="S_HALT" mask="0x0020000" caption="In Debug State"/>
          <bitfield name="S_SLEEP" mask="0x0040000" caption="Sleeping"/>
          <bitfield name="S_LOCKUP" mask="0x0080000" caption="Locked Up"/>
          <bitfield name="S_RETIRE_ST" mask="0x1000000" caption="At least one instruction has completed since last DHCSR read"/>
          <bitfield name="S_RESET_ST" mask="0x2000000" caption="At least one reset since last DHCSR read"/>
        </register>
        <register name="DCRSR" offset="0xDF4" rw="RW" size="4" initval="0x00000" caption="Debug Core Register Selector Register">
          <bitfield name="REGSEL" mask="0x0001F" values="ARM_SYSCTRL_DCRSR_REGSEL" caption="Specifies the ARM core register or special purpose register to transfer"/>
          <bitfield name="REGWNR" mask="0x10000" caption="If 1 then transfer is a write"/>
        </register>
        <register name="DCRDR" offset="0xDF8" rw="RW" size="4" initval="0x00000000" caption="Debug Core Register Data Register">
          <bitfield name="DBGTMP" mask="0xFFFFFFFF" caption="Data Temporary Cache"/>
        </register>
        <register name="DEMCR" offset="0xDFC" rw="RW" size="4" initval="0x0000000" caption="Debug Exception and Monitor Control Register">
          <bitfield name="VC_CORERESET" mask="0x0000001" caption="Reset Vector Catch Enabled"/>
          <bitfield name="VC_HARDERR" mask="0x0000400" caption="Halting Debug Trap Enabled"/>
          <bitfield name="DWTENA" mask="0x1000000" caption="DWT Enabled"/>
        </register>
        <register name="SCS_PID4" offset="0xFD0" rw="R" size="1" initval="0x04" caption="Peripheral ID Register 4">
          <bitfield name="JEP106_C_CODE" mask="0x0F" caption="JEP106 C Code"/>
          <bitfield name="BLOCK_COUNT" mask="0xF0" caption="Block Count"/>
        </register>
        <register name="SCS_PID0" offset="0xFE0" rw="R" size="1" initval="0x08" caption="Peripheral ID Register 0">
          <bitfield name="PART_NUMBER" mask="0xFF" caption="Part Number Bits 7:0"/>
        </register>
        <register name="SCS_PID1" offset="0xFE4" rw="R" size="1" initval="0xB0" caption="Peripheral ID Register 1">
          <bitfield name="PART_NUMBER" mask="0x0F" caption="Part Number Bits 11:8"/>
          <bitfield name="JEP106_ID_3_0" mask="0xF0" caption="JEP106 ID Code Bits 3:0"/>
        </register>
        <register name="SCS_PID2" offset="0xFE8" rw="R" size="1" initval="0x0B" caption="Peripheral ID Register 2">
          <bitfield name="JEP106_ID_6_4" mask="0x07" caption="JEP106 ID Code Bits 6:4"/>
          <bitfield name="JEDEC_USED" mask="0x08" caption="JEDEC Used"/>
          <bitfield name="REVISION" mask="0xF0" caption="Revision"/>
        </register>
        <register name="SCS_PID3" offset="0xFEC" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 3">
          <bitfield name="CUSTOMER_MOD_NUMBER" mask="0x0F" caption="Customer Modification Number"/>
          <bitfield name="ECO_REV_NUMBER" mask="0xF0" caption="ECO Revision Number"/>
        </register>
